/*===========================================================================

   Copyright (c) 2018-2019 Qualcomm Technologies, Inc.
   All Rights Reserved.
   Confidential and Proprietary - Qualcomm Technologies, Inc.

===========================================================================*/

#ifndef HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_5_TYPES_H
#define HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_5_TYPES_H

#include <vendor/qti/hardware/radio/ims/1.0/types.h>
#include <vendor/qti/hardware/radio/ims/1.2/types.h>
#include <vendor/qti/hardware/radio/ims/1.3/types.h>
#include <vendor/qti/hardware/radio/ims/1.4/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace qti {
namespace hardware {
namespace radio {
namespace ims {
namespace V1_5 {

// Forward declaration for forward reference support:
enum class CallFailCause : int32_t;
enum class EmergencyServiceCategory : int32_t;
enum class TirMode : int32_t;
enum class EmergencyCallRoute : int32_t;
enum class UssdModeType : int32_t;
enum class ImsSmsSendFailureReason : int32_t;
enum class ImsSmsDeliverStatusResult : int32_t;
struct CallFailCauseResponse;
struct CallInfo;
struct AutoCallRejectionInfo;
enum class ConfigItem : int32_t;
struct ConfigInfo;
enum class Result : int32_t;
struct CallForwardStatus;
struct CallForwardStatusInfo;

enum class CallFailCause : int32_t {
    CALL_FAIL_UNOBTAINABLE_NUMBER = 0,
    CALL_FAIL_NORMAL = 1 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_UNOBTAINABLE_NUMBER implicitly + 1) */,
    CALL_FAIL_BUSY = 2 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NORMAL implicitly + 1) */,
    CALL_FAIL_NORMAL_UNSPECIFIED = 3 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_BUSY implicitly + 1) */,
    CALL_FAIL_CONGESTION = 4 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NORMAL_UNSPECIFIED implicitly + 1) */,
    CALL_FAIL_INCOMPATIBILITY_DESTINATION = 5 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CONGESTION implicitly + 1) */,
    CALL_FAIL_CALL_BARRED = 6 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_INCOMPATIBILITY_DESTINATION implicitly + 1) */,
    CALL_FAIL_FDN_BLOCKED = 7 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CALL_BARRED implicitly + 1) */,
    CALL_FAIL_IMEI_NOT_ACCEPTED = 8 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_FDN_BLOCKED implicitly + 1) */,
    CALL_FAIL_DIAL_MODIFIED_TO_USSD = 9 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_IMEI_NOT_ACCEPTED implicitly + 1) */,
    CALL_FAIL_DIAL_MODIFIED_TO_SS = 10 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_USSD implicitly + 1) */,
    CALL_FAIL_DIAL_MODIFIED_TO_DIAL = 11 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_SS implicitly + 1) */,
    CALL_FAIL_EMERGENCY_TEMP_FAILURE = 12 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_DIAL implicitly + 1) */,
    CALL_FAIL_EMERGENCY_PERM_FAILURE = 13 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_EMERGENCY_TEMP_FAILURE implicitly + 1) */,
    CALL_FAIL_HO_NOT_FEASIBLE = 14 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_EMERGENCY_PERM_FAILURE implicitly + 1) */,
    CALL_FAIL_USER_BUSY = 501,
    CALL_FAIL_USER_REJECT = 502,
    CALL_FAIL_LOW_BATTERY = 503,
    CALL_FAIL_BLACKLISTED_CALL_ID = 504 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_LOW_BATTERY implicitly + 1) */,
    CALL_FAIL_CS_RETRY_REQUIRED = 505 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_BLACKLISTED_CALL_ID implicitly + 1) */,
    CALL_FAIL_NETWORK_UNAVAILABLE = 506 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CS_RETRY_REQUIRED implicitly + 1) */,
    CALL_FAIL_FEATURE_UNAVAILABLE = 507 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NETWORK_UNAVAILABLE implicitly + 1) */,
    CALL_FAIL_SIP_ERROR = 508 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_FEATURE_UNAVAILABLE implicitly + 1) */,
    CALL_FAIL_MISC = 509 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_ERROR implicitly + 1) */,
    CALL_FAIL_ANSWERED_ELSEWHERE = 510 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MISC implicitly + 1) */,
    CALL_FAIL_PULL_OUT_OF_SYNC = 511 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ANSWERED_ELSEWHERE implicitly + 1) */,
    CALL_FAIL_CAUSE_CALL_PULLED = 512 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_PULL_OUT_OF_SYNC implicitly + 1) */,
    CALL_FAIL_ACCESS_CLASS_BLOCKED = 513 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CAUSE_CALL_PULLED implicitly + 1) */,
    CALL_FAIL_SIP_REDIRECTED = 514 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ACCESS_CLASS_BLOCKED implicitly + 1) */,
    CALL_FAIL_SIP_BAD_REQUEST = 515 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REDIRECTED implicitly + 1) */,
    CALL_FAIL_SIP_FORBIDDEN = 516 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BAD_REQUEST implicitly + 1) */,
    CALL_FAIL_SIP_NOT_FOUND = 517 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_FORBIDDEN implicitly + 1) */,
    CALL_FAIL_SIP_NOT_SUPPORTED = 518 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_FOUND implicitly + 1) */,
    CALL_FAIL_SIP_REQUEST_TIMEOUT = 519 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_SUPPORTED implicitly + 1) */,
    CALL_FAIL_SIP_TEMPORARILY_UNAVAILABLE = 520 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REQUEST_TIMEOUT implicitly + 1) */,
    CALL_FAIL_SIP_BAD_ADDRESS = 521 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_TEMPORARILY_UNAVAILABLE implicitly + 1) */,
    CALL_FAIL_SIP_BUSY = 522 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BAD_ADDRESS implicitly + 1) */,
    CALL_FAIL_SIP_REQUEST_CANCELLED = 523 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BUSY implicitly + 1) */,
    CALL_FAIL_SIP_NOT_ACCEPTABLE = 524 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REQUEST_CANCELLED implicitly + 1) */,
    CALL_FAIL_SIP_NOT_REACHABLE = 525 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_ACCEPTABLE implicitly + 1) */,
    CALL_FAIL_SIP_SERVER_INTERNAL_ERROR = 526 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_REACHABLE implicitly + 1) */,
    CALL_FAIL_SIP_SERVER_NOT_IMPLEMENTED = 527 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_INTERNAL_ERROR implicitly + 1) */,
    CALL_FAIL_SIP_SERVER_BAD_GATEWAY = 528 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_NOT_IMPLEMENTED implicitly + 1) */,
    CALL_FAIL_SIP_SERVICE_UNAVAILABLE = 529 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_BAD_GATEWAY implicitly + 1) */,
    CALL_FAIL_SIP_SERVER_TIMEOUT = 530 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVICE_UNAVAILABLE implicitly + 1) */,
    CALL_FAIL_SIP_SERVER_VERSION_UNSUPPORTED = 531 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_TIMEOUT implicitly + 1) */,
    CALL_FAIL_SIP_SERVER_MESSAGE_TOOLARGE = 532 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_VERSION_UNSUPPORTED implicitly + 1) */,
    CALL_FAIL_SIP_SERVER_PRECONDITION_FAILURE = 533 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_MESSAGE_TOOLARGE implicitly + 1) */,
    CALL_FAIL_SIP_USER_REJECTED = 534 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_PRECONDITION_FAILURE implicitly + 1) */,
    CALL_FAIL_SIP_GLOBAL_ERROR = 535 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_USER_REJECTED implicitly + 1) */,
    CALL_FAIL_MEDIA_INIT_FAILED = 536 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_GLOBAL_ERROR implicitly + 1) */,
    CALL_FAIL_MEDIA_NO_DATA = 537 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_INIT_FAILED implicitly + 1) */,
    CALL_FAIL_MEDIA_NOT_ACCEPTABLE = 538 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_NO_DATA implicitly + 1) */,
    CALL_FAIL_MEDIA_UNSPECIFIED_ERROR = 539 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_NOT_ACCEPTABLE implicitly + 1) */,
    CALL_FAIL_HOLD_RESUME_FAILED = 540 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_UNSPECIFIED_ERROR implicitly + 1) */,
    CALL_FAIL_HOLD_RESUME_CANCELED = 541 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_RESUME_FAILED implicitly + 1) */,
    CALL_FAIL_HOLD_REINVITE_COLLISION = 542 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_RESUME_CANCELED implicitly + 1) */,
    CALL_FAIL_DIAL_MODIFIED_TO_DIAL_VIDEO = 543 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_REINVITE_COLLISION implicitly + 1) */,
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL = 544 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_DIAL_VIDEO implicitly + 1) */,
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL_VIDEO = 545 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL implicitly + 1) */,
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_SS = 546 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL_VIDEO implicitly + 1) */,
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_USSD = 547 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_SS implicitly + 1) */,
    CALL_FAIL_ERROR_UNSPECIFIED = 548 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_USSD implicitly + 1) */,
    CALL_FAIL_INVALID = 549 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ERROR_UNSPECIFIED implicitly + 1) */,
    CALL_FAIL_SIP_ALTERNATE_EMERGENCY_CALL = 550 /* (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_INVALID implicitly + 1) */,
    CALL_FAIL_RADIO_OFF = 551 /* (::vendor::qti::hardware::radio::ims::V1_1::CallFailCause.CALL_FAIL_SIP_ALTERNATE_EMERGENCY_CALL implicitly + 1) */,
    CALL_FAIL_OUT_OF_SERVICE = 552 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_OFF implicitly + 1) */,
    CALL_FAIL_NO_VALID_SIM = 553 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OUT_OF_SERVICE implicitly + 1) */,
    CALL_FAIL_RADIO_INTERNAL_ERROR = 554 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_NO_VALID_SIM implicitly + 1) */,
    CALL_FAIL_NETWORK_RESP_TIMEOUT = 555 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_INTERNAL_ERROR implicitly + 1) */,
    CALL_FAIL_NETWORK_REJECT = 556 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_NETWORK_RESP_TIMEOUT implicitly + 1) */,
    CALL_FAIL_RADIO_ACCESS_FAILURE = 557 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_NETWORK_REJECT implicitly + 1) */,
    CALL_FAIL_RADIO_LINK_FAILURE = 558 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_ACCESS_FAILURE implicitly + 1) */,
    CALL_FAIL_RADIO_LINK_LOST = 559 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_LINK_FAILURE implicitly + 1) */,
    CALL_FAIL_RADIO_UPLINK_FAILURE = 560 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_LINK_LOST implicitly + 1) */,
    CALL_FAIL_RADIO_SETUP_FAILURE = 561 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_UPLINK_FAILURE implicitly + 1) */,
    CALL_FAIL_RADIO_RELEASE_NORMAL = 562 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_SETUP_FAILURE implicitly + 1) */,
    CALL_FAIL_RADIO_RELEASE_ABNORMAL = 563 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_RELEASE_NORMAL implicitly + 1) */,
    CALL_FAIL_NETWORK_DETACH = 564 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_RELEASE_ABNORMAL implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_1 = 565 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_NETWORK_DETACH implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_2 = 566 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_1 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_3 = 567 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_2 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_4 = 568 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_3 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_5 = 569 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_4 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_6 = 570 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_5 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_7 = 571 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_6 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_8 = 572 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_7 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_9 = 573 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_8 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_10 = 574 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_9 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_11 = 575 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_10 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_12 = 576 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_11 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_13 = 577 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_12 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_14 = 578 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_13 implicitly + 1) */,
    CALL_FAIL_OEM_CAUSE_15 = 579 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_14 implicitly + 1) */,
    CALL_FAIL_NO_CSFB_IN_CS_ROAM = 580 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_15 implicitly + 1) */,
    CALL_FAIL_SRV_NOT_REGISTERED = 581 /* (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_NO_CSFB_IN_CS_ROAM implicitly + 1) */,
    CALL_FAIL_CALL_TYPE_NOT_ALLOWED = 582 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_SRV_NOT_REGISTERED implicitly + 1) */,
    CALL_FAIL_EMRG_CALL_ONGOING = 583 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_CALL_TYPE_NOT_ALLOWED implicitly + 1) */,
    CALL_FAIL_CALL_SETUP_ONGOING = 584 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_EMRG_CALL_ONGOING implicitly + 1) */,
    CALL_FAIL_MAX_CALL_LIMIT_REACHED = 585 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_CALL_SETUP_ONGOING implicitly + 1) */,
    CALL_FAIL_UNSUPPORTED_SIP_HDRS = 586 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_MAX_CALL_LIMIT_REACHED implicitly + 1) */,
    CALL_FAIL_CALL_TRANSFER_ONGOING = 587 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_UNSUPPORTED_SIP_HDRS implicitly + 1) */,
    CALL_FAIL_PRACK_TIMEOUT = 588 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_CALL_TRANSFER_ONGOING implicitly + 1) */,
    CALL_FAIL_QOS_FAILURE = 589 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_PRACK_TIMEOUT implicitly + 1) */,
    CALL_FAIL_ONGOING_HANDOVER = 590 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_QOS_FAILURE implicitly + 1) */,
    CALL_FAIL_VT_WITH_TTY_NOT_ALLOWED = 591 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_ONGOING_HANDOVER implicitly + 1) */,
    CALL_FAIL_CALL_UPGRADE_ONGOING = 592 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_VT_WITH_TTY_NOT_ALLOWED implicitly + 1) */,
    CALL_FAIL_CONFERENCE_WITH_TTY_NOT_ALLOWED = 593 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_CALL_UPGRADE_ONGOING implicitly + 1) */,
    CALL_FAIL_CALL_CONFERENCE_ONGOING = 594 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_CONFERENCE_WITH_TTY_NOT_ALLOWED implicitly + 1) */,
    CALL_FAIL_VT_WITH_AVPF_NOT_ALLOWED = 595 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_CALL_CONFERENCE_ONGOING implicitly + 1) */,
    CALL_FAIL_ENCRYPTION_CALL_ONGOING = 596 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_VT_WITH_AVPF_NOT_ALLOWED implicitly + 1) */,
    CALL_FAIL_CALL_ONGOING_CW_DISABLED = 597 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_ENCRYPTION_CALL_ONGOING implicitly + 1) */,
    CALL_FAIL_CALL_ON_OTHER_SUB = 598 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_CALL_ONGOING_CW_DISABLED implicitly + 1) */,
    CALL_FAIL_1X_COLLISION = 599 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_CALL_ON_OTHER_SUB implicitly + 1) */,
    CALL_FAIL_UI_NOT_READY = 600 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_1X_COLLISION implicitly + 1) */,
    CALL_FAIL_CS_CALL_ONGOING = 601 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_UI_NOT_READY implicitly + 1) */,
    CALL_FAIL_SIP_USER_MARKED_UNWANTED = 602 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_CS_CALL_ONGOING implicitly + 1) */,
    CALL_FAIL_REJECTED_ELSEWHERE = 603 /* (::vendor::qti::hardware::radio::ims::V1_3::CallFailCause.CALL_FAIL_SIP_USER_MARKED_UNWANTED implicitly + 1) */,
    CALL_FAIL_USER_REJECTED_SESSION_MODIFICATION = 604 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_REJECTED_ELSEWHERE implicitly + 1) */,
    CALL_FAIL_USER_CANCELLED_SESSION_MODIFICATION = 605 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_USER_REJECTED_SESSION_MODIFICATION implicitly + 1) */,
    CALL_FAIL_SESSION_MODIFICATION_FAILED = 606 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_USER_CANCELLED_SESSION_MODIFICATION implicitly + 1) */,
    CALL_FAIL_SIP_METHOD_NOT_ALLOWED = 607 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SESSION_MODIFICATION_FAILED implicitly + 1) */,
    CALL_FAIL_SIP_PROXY_AUTHENTICATION_REQUIRED = 608 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_METHOD_NOT_ALLOWED implicitly + 1) */,
    CALL_FAIL_SIP_REQUEST_ENTITY_TOO_LARGE = 609 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_PROXY_AUTHENTICATION_REQUIRED implicitly + 1) */,
    CALL_FAIL_SIP_REQUEST_URI_TOO_LARGE = 610 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_REQUEST_ENTITY_TOO_LARGE implicitly + 1) */,
    CALL_FAIL_SIP_EXTENSION_REQUIRED = 611 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_REQUEST_URI_TOO_LARGE implicitly + 1) */,
    CALL_FAIL_SIP_INTERVAL_TOO_BRIEF = 612 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_EXTENSION_REQUIRED implicitly + 1) */,
    CALL_FAIL_SIP_CALL_OR_TRANS_DOES_NOT_EXIST = 613 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_INTERVAL_TOO_BRIEF implicitly + 1) */,
    CALL_FAIL_SIP_LOOP_DETECTED = 614 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_CALL_OR_TRANS_DOES_NOT_EXIST implicitly + 1) */,
    CALL_FAIL_SIP_TOO_MANY_HOPS = 615 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_LOOP_DETECTED implicitly + 1) */,
    CALL_FAIL_SIP_AMBIGUOUS = 616 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_TOO_MANY_HOPS implicitly + 1) */,
    CALL_FAIL_SIP_REQUEST_PENDING = 617 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_AMBIGUOUS implicitly + 1) */,
    CALL_FAIL_SIP_UNDECIPHERABLE = 618 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_REQUEST_PENDING implicitly + 1) */,
    CALL_FAIL_RETRY_ON_IMS_WITHOUT_RTT = 619 /* (::vendor::qti::hardware::radio::ims::V1_5::CallFailCause.CALL_FAIL_SIP_UNDECIPHERABLE implicitly + 1) */,
};

enum class EmergencyServiceCategory : int32_t {
    /**
     * General emergency call, all categories
     */
    UNSPECIFIED = 0,
    POLICE = 1 /* (1 << 0) */,
    AMBULANCE = 2 /* (1 << 1) */,
    FIRE_BRIGADE = 4 /* (1 << 2) */,
    MARINE_GUARD = 8 /* (1 << 3) */,
    MOUNTAIN_RESCUE = 16 /* (1 << 4) */,
    /**
     * Manually Initiated eCall (MIeC)
     */
    MIEC = 32 /* (1 << 5) */,
    /**
     * Automatically Initiated eCall (AIeC)
     */
    AIEC = 64 /* (1 << 6) */,
};

enum class TirMode : int32_t {
    INVALID = 0,
    TEMPORARY = 1 /* (::vendor::qti::hardware::radio::ims::V1_5::TirMode.INVALID implicitly + 1) */,
    PERMANENT = 2 /* (::vendor::qti::hardware::radio::ims::V1_5::TirMode.TEMPORARY implicitly + 1) */,
};

enum class EmergencyCallRoute : int32_t {
    UNKNOWN = 0,
    EMERGENCY = 1,
    NORMAL = 2,
};

enum class UssdModeType : int32_t {
    NOTIFY = 0,
    REQUEST = 1 /* (::vendor::qti::hardware::radio::ims::V1_5::UssdModeType.NOTIFY implicitly + 1) */,
    NW_RELEASE = 2 /* (::vendor::qti::hardware::radio::ims::V1_5::UssdModeType.REQUEST implicitly + 1) */,
    LOCAL_CLIENT = 3 /* (::vendor::qti::hardware::radio::ims::V1_5::UssdModeType.NW_RELEASE implicitly + 1) */,
    NOT_SUPPORTED = 4 /* (::vendor::qti::hardware::radio::ims::V1_5::UssdModeType.LOCAL_CLIENT implicitly + 1) */,
    NW_TIMEOUT = 5 /* (::vendor::qti::hardware::radio::ims::V1_5::UssdModeType.NOT_SUPPORTED implicitly + 1) */,
};

enum class ImsSmsSendFailureReason : int32_t {
    RESULT_ERROR_NONE = 0,
    /**
     * Generic failure cause
     */
    RESULT_ERROR_GENERIC_FAILURE = 1 /* (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_NONE implicitly + 1) */,
    /**
     * Failed because radio was explicitly turned off
     */
    RESULT_ERROR_RADIO_OFF = 2 /* (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_GENERIC_FAILURE implicitly + 1) */,
    /**
     * Failed because no pdu provided
     */
    RESULT_ERROR_NULL_PDU = 3 /* (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_RADIO_OFF implicitly + 1) */,
    /**
     * Failed because service is currently unavailable
     */
    RESULT_ERROR_NO_SERVICE = 4 /* (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_NULL_PDU implicitly + 1) */,
    /**
     * Failed because we reached the sending queue limit.
     */
    RESULT_ERROR_LIMIT_EXCEEDED = 5 /* (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_NO_SERVICE implicitly + 1) */,
    /**
     * Failed because user denied the sending of this short code.
     */
    RESULT_ERROR_SHORT_CODE_NOT_ALLOWED = 6 /* (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_LIMIT_EXCEEDED implicitly + 1) */,
    /**
     * Failed because the user has denied this app
     * ever send premium short codes.
     */
    RESULT_ERROR_SHORT_CODE_NEVER_ALLOWED = 7 /* (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_SHORT_CODE_NOT_ALLOWED implicitly + 1) */,
    /**
     * Failed because FDN is enabled.
     */
    RESULT_ERROR_FDN_CHECK_FAILURE = 8 /* (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_SHORT_CODE_NEVER_ALLOWED implicitly + 1) */,
    /**
     * Failed because the radio was not available.
     */
    RESULT_RADIO_NOT_AVAILABLE = 9 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_ERROR_FDN_CHECK_FAILURE implicitly + 1) */,
    /**
     * Failed because of network rejection.
     */
    RESULT_NETWORK_REJECT = 10 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_RADIO_NOT_AVAILABLE implicitly + 1) */,
    /**
     * Failed because of invalid arguments.
     */
    RESULT_INVALID_ARGUMENTS = 11 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_NETWORK_REJECT implicitly + 1) */,
    /**
     * Failed because of an invalid state.
     */
    RESULT_INVALID_STATE = 12 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_INVALID_ARGUMENTS implicitly + 1) */,
    /**
     * Failed because there is no memory.
     */
    RESULT_NO_MEMORY = 13 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_INVALID_STATE implicitly + 1) */,
    /**
     * Failed because the sms format is not valid.
     */
    RESULT_INVALID_SMS_FORMAT = 14 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_NO_MEMORY implicitly + 1) */,
    /**
     * Failed because of a system error.
     */
    RESULT_SYSTEM_ERROR = 15 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_INVALID_SMS_FORMAT implicitly + 1) */,
    /**
     * Failed because of a modem error.
     */
    RESULT_MODEM_ERROR = 16 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_SYSTEM_ERROR implicitly + 1) */,
    /**
     * Failed because of a network error.
     */
    RESULT_NETWORK_ERROR = 17 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_MODEM_ERROR implicitly + 1) */,
    /**
     * Failed because of an encoding error.
     */
    RESULT_ENCODING_ERROR = 18 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_NETWORK_ERROR implicitly + 1) */,
    /**
     * Failed because of an invalid smsc address.
     */
    RESULT_INVALID_SMSC_ADDRESS = 19 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_ENCODING_ERROR implicitly + 1) */,
    /**
     * Failed because the operation is not allowed.
     */
    RESULT_OPERATION_NOT_ALLOWED = 20 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_INVALID_SMSC_ADDRESS implicitly + 1) */,
    RESULT_INTERNAL_ERROR = 21 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_OPERATION_NOT_ALLOWED implicitly + 1) */,
    /**
     * Failed because there are no resources.
     */
    RESULT_NO_RESOURCES = 22 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_INTERNAL_ERROR implicitly + 1) */,
    /**
     * Failed because the operation was cancelled.
     */
    RESULT_CANCELLED = 23 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_NO_RESOURCES implicitly + 1) */,
    /**
     * Failed because the request is not supported.
     */
    RESULT_REQUEST_NOT_SUPPORTED = 24 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsSendFailureReason.RESULT_CANCELLED implicitly + 1) */,
};

enum class ImsSmsDeliverStatusResult : int32_t {
    /**
     * Message was delivered successfully.
     */
    DELIVER_STATUS_OK = 0,
    /**
     * Message was not delivered.
     */
    DELIVER_STATUS_ERROR = 1 /* (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsDeliverStatusResult.DELIVER_STATUS_OK implicitly + 1) */,
    /**
     * Message was not delivered due to lack of memory.
     */
    DELIVER_STATUS_ERROR_NO_MEMORY = 2 /* (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsDeliverStatusResult.DELIVER_STATUS_ERROR implicitly + 1) */,
    /**
     * Message was not delivered as the request is not supported.
     */
    DELIVER_STATUS_ERROR_REQUEST_NOT_SUPPORTED = 3 /* (::vendor::qti::hardware::radio::ims::V1_5::ImsSmsDeliverStatusResult.DELIVER_STATUS_ERROR_NO_MEMORY implicitly + 1) */,
};

struct CallFailCauseResponse final {
    ::vendor::qti::hardware::radio::ims::V1_5::CallFailCause failCause __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> errorinfo __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string networkErrorString __attribute__ ((aligned(8)));
    bool hasErrorDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo errorDetails __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallFailCauseResponse, failCause) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallFailCauseResponse, errorinfo) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallFailCauseResponse, networkErrorString) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallFailCauseResponse, hasErrorDetails) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallFailCauseResponse, errorDetails) == 48, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_5::CallFailCauseResponse) == 72, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_5::CallFailCauseResponse) == 8, "wrong alignment");

struct CallInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::CallState state __attribute__ ((aligned(4)));
    uint32_t index __attribute__ ((aligned(4)));
    uint32_t toa __attribute__ ((aligned(4)));
    bool hasIsMpty __attribute__ ((aligned(1)));
    bool isMpty __attribute__ ((aligned(1)));
    bool hasIsMT __attribute__ ((aligned(1)));
    bool isMT __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal mtMultiLineInfo __attribute__ ((aligned(8)));
    uint32_t als __attribute__ ((aligned(4)));
    bool hasIsVoice __attribute__ ((aligned(1)));
    bool isVoice __attribute__ ((aligned(1)));
    bool hasIsVoicePrivacy __attribute__ ((aligned(1)));
    bool isVoicePrivacy __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    uint32_t numberPresentation __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    uint32_t namePresentation __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallDetails callDetails __attribute__ ((aligned(8)));
    bool hasFailCause __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_5::CallFailCauseResponse failCause __attribute__ ((aligned(8)));
    bool hasIsEncrypted __attribute__ ((aligned(1)));
    bool isEncrypted __attribute__ ((aligned(1)));
    bool hasIsCalledPartyRinging __attribute__ ((aligned(1)));
    bool isCalledPartyRinging __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string historyInfo __attribute__ ((aligned(8)));
    bool hasIsVideoConfSupported __attribute__ ((aligned(1)));
    bool isVideoConfSupported __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_3::VerstatInfo verstatInfo __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_5::TirMode tirMode __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, state) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, index) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, toa) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, hasIsMpty) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, isMpty) == 13, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, hasIsMT) == 14, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, isMT) == 15, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, mtMultiLineInfo) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, als) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, hasIsVoice) == 44, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, isVoice) == 45, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, hasIsVoicePrivacy) == 46, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, isVoicePrivacy) == 47, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, number) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, numberPresentation) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, name) == 72, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, namePresentation) == 88, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, hasCallDetails) == 92, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, callDetails) == 96, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, hasFailCause) == 192, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, failCause) == 200, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, hasIsEncrypted) == 272, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, isEncrypted) == 273, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, hasIsCalledPartyRinging) == 274, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, isCalledPartyRinging) == 275, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, historyInfo) == 280, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, hasIsVideoConfSupported) == 296, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, isVideoConfSupported) == 297, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, verstatInfo) == 300, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo, tirMode) == 308, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo) == 312, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_5::CallInfo) == 8, "wrong alignment");

struct AutoCallRejectionInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::CallType callType __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_5::CallFailCause autoRejectionCause __attribute__ ((aligned(4)));
    uint16_t sipErrorCode __attribute__ ((aligned(2)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::AutoCallRejectionInfo, callType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::AutoCallRejectionInfo, autoRejectionCause) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::AutoCallRejectionInfo, sipErrorCode) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::AutoCallRejectionInfo, number) == 16, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_5::AutoCallRejectionInfo) == 32, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_5::AutoCallRejectionInfo) == 8, "wrong alignment");

enum class ConfigItem : int32_t {
    CONFIG_ITEM_NONE = 0,
    CONFIG_ITEM_VOCODER_AMRMODESET = 1 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_NONE implicitly + 1) */,
    CONFIG_ITEM_VOCODER_AMRWBMODESET = 2 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOCODER_AMRMODESET implicitly + 1) */,
    CONFIG_ITEM_SIP_SESSION_TIMER = 3 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOCODER_AMRWBMODESET implicitly + 1) */,
    CONFIG_ITEM_MIN_SESSION_EXPIRY = 4 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_SESSION_TIMER implicitly + 1) */,
    CONFIG_ITEM_CANCELLATION_TIMER = 5 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_MIN_SESSION_EXPIRY implicitly + 1) */,
    CONFIG_ITEM_T_DELAY = 6 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CANCELLATION_TIMER implicitly + 1) */,
    CONFIG_ITEM_SILENT_REDIAL_ENABLE = 7 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_DELAY implicitly + 1) */,
    CONFIG_ITEM_SIP_T1_TIMER = 8 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SILENT_REDIAL_ENABLE implicitly + 1) */,
    CONFIG_ITEM_SIP_T2_TIMER = 9 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_T1_TIMER implicitly + 1) */,
    CONFIG_ITEM_SIP_TF_TIMER = 10 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_T2_TIMER implicitly + 1) */,
    CONFIG_ITEM_VLT_SETTING_ENABLED = 11 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_TF_TIMER implicitly + 1) */,
    CONFIG_ITEM_LVC_SETTING_ENABLED = 12 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VLT_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_DOMAIN_NAME = 13 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_LVC_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_SMS_FORMAT = 14 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_DOMAIN_NAME implicitly + 1) */,
    CONFIG_ITEM_SMS_OVER_IP = 15 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_FORMAT implicitly + 1) */,
    CONFIG_ITEM_PUBLISH_TIMER = 16 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_OVER_IP implicitly + 1) */,
    CONFIG_ITEM_PUBLISH_TIMER_EXTENDED = 17 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_PUBLISH_TIMER implicitly + 1) */,
    CONFIG_ITEM_CAPABILITIES_CACHE_EXPIRATION = 18 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_PUBLISH_TIMER_EXTENDED implicitly + 1) */,
    CONFIG_ITEM_AVAILABILITY_CACHE_EXPIRATION = 19 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPABILITIES_CACHE_EXPIRATION implicitly + 1) */,
    CONFIG_ITEM_CAPABILITIES_POLL_INTERVAL = 20 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AVAILABILITY_CACHE_EXPIRATION implicitly + 1) */,
    CONFIG_ITEM_SOURCE_THROTTLE_PUBLISH = 21 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPABILITIES_POLL_INTERVAL implicitly + 1) */,
    CONFIG_ITEM_MAX_NUM_ENTRIES_IN_RCL = 22 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SOURCE_THROTTLE_PUBLISH implicitly + 1) */,
    CONFIG_ITEM_CAPAB_POLL_LIST_SUB_EXP = 23 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_MAX_NUM_ENTRIES_IN_RCL implicitly + 1) */,
    CONFIG_ITEM_GZIP_FLAG = 24 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPAB_POLL_LIST_SUB_EXP implicitly + 1) */,
    CONFIG_ITEM_EAB_SETTING_ENABLED = 25 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_GZIP_FLAG implicitly + 1) */,
    CONFIG_ITEM_MOBILE_DATA_ENABLED = 26 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_EAB_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_VOICE_OVER_WIFI_ENABLED = 27 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_MOBILE_DATA_ENABLED implicitly + 1) */,
    CONFIG_ITEM_VOICE_OVER_WIFI_ROAMING = 28 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOICE_OVER_WIFI_ENABLED implicitly + 1) */,
    CONFIG_ITEM_VOICE_OVER_WIFI_MODE = 29 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOICE_OVER_WIFI_ROAMING implicitly + 1) */,
    CONFIG_ITEM_CAPABILITY_DISCOVERY_ENABLED = 30 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOICE_OVER_WIFI_MODE implicitly + 1) */,
    CONFIG_ITEM_EMERGENCY_CALL_TIMER = 31 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPABILITY_DISCOVERY_ENABLED implicitly + 1) */,
    CONFIG_ITEM_SSAC_HYSTERESIS_TIMER = 32 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_EMERGENCY_CALL_TIMER implicitly + 1) */,
    CONFIG_ITEM_VOLTE_USER_OPT_IN_STATUS = 33 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SSAC_HYSTERESIS_TIMER implicitly + 1) */,
    CONFIG_ITEM_LBO_PCSCF_ADDRESS = 34 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOLTE_USER_OPT_IN_STATUS implicitly + 1) */,
    CONFIG_ITEM_KEEP_ALIVE_ENABLED = 35 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_LBO_PCSCF_ADDRESS implicitly + 1) */,
    CONFIG_ITEM_REGISTRATION_RETRY_BASE_TIME_SEC = 36 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_KEEP_ALIVE_ENABLED implicitly + 1) */,
    CONFIG_ITEM_REGISTRATION_RETRY_MAX_TIME_SEC = 37 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_REGISTRATION_RETRY_BASE_TIME_SEC implicitly + 1) */,
    CONFIG_ITEM_SPEECH_START_PORT = 38 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_REGISTRATION_RETRY_MAX_TIME_SEC implicitly + 1) */,
    CONFIG_ITEM_SPEECH_END_PORT = 39 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SPEECH_START_PORT implicitly + 1) */,
    CONFIG_ITEM_SIP_INVITE_REQ_RETX_INTERVAL_MSEC = 40 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SPEECH_END_PORT implicitly + 1) */,
    CONFIG_ITEM_SIP_INVITE_RSP_WAIT_TIME_MSEC = 41 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_REQ_RETX_INTERVAL_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_INVITE_RSP_RETX_WAIT_TIME_MSEC = 42 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_RSP_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_INTERVAL_MSEC = 43 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_RSP_RETX_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_NON_INVITE_TXN_TIMEOUT_TIMER_MSEC = 44 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_INTERVAL_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_INVITE_RSP_RETX_INTERVAL_MSEC = 45 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_TXN_TIMEOUT_TIMER_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_ACK_RECEIPT_WAIT_TIME_MSEC = 46 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_RSP_RETX_INTERVAL_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_ACK_RETX_WAIT_TIME_MSEC = 47 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_ACK_RECEIPT_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_WAIT_TIME_MSEC = 48 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_ACK_RETX_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_SIP_NON_INVITE_RSP_RETX_WAIT_TIME_MSEC = 49 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_AMR_WB_OCTET_ALIGNED_PT = 50 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_RSP_RETX_WAIT_TIME_MSEC implicitly + 1) */,
    CONFIG_ITEM_AMR_WB_BANDWIDTH_EFFICIENT_PT = 51 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_WB_OCTET_ALIGNED_PT implicitly + 1) */,
    CONFIG_ITEM_AMR_OCTET_ALIGNED_PT = 52 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_WB_BANDWIDTH_EFFICIENT_PT implicitly + 1) */,
    CONFIG_ITEM_AMR_BANDWIDTH_EFFICIENT_PT = 53 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_OCTET_ALIGNED_PT implicitly + 1) */,
    CONFIG_ITEM_DTMF_WB_PT = 54 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_BANDWIDTH_EFFICIENT_PT implicitly + 1) */,
    CONFIG_ITEM_DTMF_NB_PT = 55 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_DTMF_WB_PT implicitly + 1) */,
    CONFIG_ITEM_AMR_DEFAULT_MODE = 56 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_DTMF_NB_PT implicitly + 1) */,
    CONFIG_ITEM_SMS_PSI = 57 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_DEFAULT_MODE implicitly + 1) */,
    CONFIG_ITEM_VIDEO_QUALITY = 58 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_PSI implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_LTE1 = 59 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VIDEO_QUALITY implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_LTE2 = 60 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_LTE1 implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_LTE3 = 61 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_LTE2 implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_1x = 62 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_LTE3 implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_WIFI_A = 63 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_1x implicitly + 1) */,
    CONFIG_ITEM_THRESHOLD_WIFI_B = 64 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_WIFI_A implicitly + 1) */,
    CONFIG_ITEM_T_EPDG_LTE = 65 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_WIFI_B implicitly + 1) */,
    CONFIG_ITEM_T_EPDG_WIFI = 66 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_EPDG_LTE implicitly + 1) */,
    CONFIG_ITEM_T_EPDG_1x = 67 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_EPDG_WIFI implicitly + 1) */,
    CONFIG_ITEM_VWF_SETTING_ENABLED = 68 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_EPDG_1x implicitly + 1) */,
    CONFIG_ITEM_VCE_SETTING_ENABLED = 69 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VWF_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_RTT_SETTING_ENABLED = 70 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VCE_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_SMS_APP = 71 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_RTT_SETTING_ENABLED implicitly + 1) */,
    CONFIG_ITEM_VVM_APP = 72 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_APP implicitly + 1) */,
    CONFIG_ITEM_INVALID = 73 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VVM_APP implicitly + 1) */,
    CONFIG_ITEM_VOICE_OVER_WIFI_ROAMING_MODE = 74 /* (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_INVALID implicitly + 1) */,
};

struct ConfigInfo final {
    ::vendor::qti::hardware::radio::ims::V1_5::ConfigItem item __attribute__ ((aligned(4)));
    bool hasBoolValue __attribute__ ((aligned(1)));
    bool boolValue __attribute__ ((aligned(1)));
    uint32_t intValue __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string stringValue __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_0::ConfigFailureCause errorCause __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::ConfigInfo, item) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::ConfigInfo, hasBoolValue) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::ConfigInfo, boolValue) == 5, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::ConfigInfo, intValue) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::ConfigInfo, stringValue) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::ConfigInfo, errorCause) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_5::ConfigInfo) == 40, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_5::ConfigInfo) == 8, "wrong alignment");

enum class Result : int32_t {
    SUCCESS = 0,
    FAILURE = 1 /* (::vendor::qti::hardware::radio::ims::V1_5::Result.SUCCESS implicitly + 1) */,
};

struct CallForwardStatus final {
    uint32_t reason __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_5::Result status __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo errorDetails __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallForwardStatus, reason) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallForwardStatus, status) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallForwardStatus, errorDetails) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_5::CallForwardStatus) == 32, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_5::CallForwardStatus) == 8, "wrong alignment");

struct CallForwardStatusInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo errorDetails __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_5::CallForwardStatus> status __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallForwardStatusInfo, errorDetails) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_5::CallForwardStatusInfo, status) == 24, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_5::CallForwardStatusInfo) == 40, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_5::CallForwardStatusInfo) == 8, "wrong alignment");

//
// type declarations for package
//

template<typename>
static inline std::string toString(int32_t o);
static inline std::string toString(::vendor::qti::hardware::radio::ims::V1_5::CallFailCause o);

constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_5::CallFailCause lhs, const ::vendor::qti::hardware::radio::ims::V1_5::CallFailCause rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const int32_t lhs, const ::vendor::qti::hardware::radio::ims::V1_5::CallFailCause rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}
constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_5::CallFailCause lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}
