/*
  Copyright (c) 2018 Qualcomm Technologies, Inc.
  All Rights Reserved.
  Confidential and Proprietary - Qualcomm Technologies, Inc.
*/

#ifndef HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_1_TYPES_H
#define HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_1_TYPES_H

#include <vendor/qti/hardware/radio/ims/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace qti {
namespace hardware {
namespace radio {
namespace ims {
namespace V1_1 {

// Forward declaration for forward reference support:
enum class CallFailCause : int32_t;
struct CallFailCauseResponse;
struct HangupRequestInfo;
struct CallInfo;

enum class CallFailCause : int32_t {
    CALL_FAIL_UNOBTAINABLE_NUMBER = 0,
    CALL_FAIL_NORMAL = 1, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_UNOBTAINABLE_NUMBER implicitly + 1)
    CALL_FAIL_BUSY = 2, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NORMAL implicitly + 1)
    CALL_FAIL_NORMAL_UNSPECIFIED = 3, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_BUSY implicitly + 1)
    CALL_FAIL_CONGESTION = 4, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NORMAL_UNSPECIFIED implicitly + 1)
    CALL_FAIL_INCOMPATIBILITY_DESTINATION = 5, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CONGESTION implicitly + 1)
    CALL_FAIL_CALL_BARRED = 6, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_INCOMPATIBILITY_DESTINATION implicitly + 1)
    CALL_FAIL_FDN_BLOCKED = 7, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CALL_BARRED implicitly + 1)
    CALL_FAIL_IMEI_NOT_ACCEPTED = 8, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_FDN_BLOCKED implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_USSD = 9, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_IMEI_NOT_ACCEPTED implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_SS = 10, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_USSD implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_DIAL = 11, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_SS implicitly + 1)
    CALL_FAIL_EMERGENCY_TEMP_FAILURE = 12, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_DIAL implicitly + 1)
    CALL_FAIL_EMERGENCY_PERM_FAILURE = 13, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_EMERGENCY_TEMP_FAILURE implicitly + 1)
    CALL_FAIL_HO_NOT_FEASIBLE = 14, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_EMERGENCY_PERM_FAILURE implicitly + 1)
    CALL_FAIL_USER_BUSY = 501,
    CALL_FAIL_USER_REJECT = 502,
    CALL_FAIL_LOW_BATTERY = 503,
    CALL_FAIL_BLACKLISTED_CALL_ID = 504, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_LOW_BATTERY implicitly + 1)
    CALL_FAIL_CS_RETRY_REQUIRED = 505, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_BLACKLISTED_CALL_ID implicitly + 1)
    CALL_FAIL_NETWORK_UNAVAILABLE = 506, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CS_RETRY_REQUIRED implicitly + 1)
    CALL_FAIL_FEATURE_UNAVAILABLE = 507, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NETWORK_UNAVAILABLE implicitly + 1)
    CALL_FAIL_SIP_ERROR = 508, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_FEATURE_UNAVAILABLE implicitly + 1)
    CALL_FAIL_MISC = 509, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_ERROR implicitly + 1)
    CALL_FAIL_ANSWERED_ELSEWHERE = 510, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MISC implicitly + 1)
    CALL_FAIL_PULL_OUT_OF_SYNC = 511, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ANSWERED_ELSEWHERE implicitly + 1)
    CALL_FAIL_CAUSE_CALL_PULLED = 512, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_PULL_OUT_OF_SYNC implicitly + 1)
    CALL_FAIL_ACCESS_CLASS_BLOCKED = 513, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CAUSE_CALL_PULLED implicitly + 1)
    CALL_FAIL_SIP_REDIRECTED = 514, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ACCESS_CLASS_BLOCKED implicitly + 1)
    CALL_FAIL_SIP_BAD_REQUEST = 515, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REDIRECTED implicitly + 1)
    CALL_FAIL_SIP_FORBIDDEN = 516, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BAD_REQUEST implicitly + 1)
    CALL_FAIL_SIP_NOT_FOUND = 517, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_FORBIDDEN implicitly + 1)
    CALL_FAIL_SIP_NOT_SUPPORTED = 518, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_FOUND implicitly + 1)
    CALL_FAIL_SIP_REQUEST_TIMEOUT = 519, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_SUPPORTED implicitly + 1)
    CALL_FAIL_SIP_TEMPORARILY_UNAVAILABLE = 520, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REQUEST_TIMEOUT implicitly + 1)
    CALL_FAIL_SIP_BAD_ADDRESS = 521, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_TEMPORARILY_UNAVAILABLE implicitly + 1)
    CALL_FAIL_SIP_BUSY = 522, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BAD_ADDRESS implicitly + 1)
    CALL_FAIL_SIP_REQUEST_CANCELLED = 523, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BUSY implicitly + 1)
    CALL_FAIL_SIP_NOT_ACCEPTABLE = 524, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REQUEST_CANCELLED implicitly + 1)
    CALL_FAIL_SIP_NOT_REACHABLE = 525, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_ACCEPTABLE implicitly + 1)
    CALL_FAIL_SIP_SERVER_INTERNAL_ERROR = 526, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_REACHABLE implicitly + 1)
    CALL_FAIL_SIP_SERVER_NOT_IMPLEMENTED = 527, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_INTERNAL_ERROR implicitly + 1)
    CALL_FAIL_SIP_SERVER_BAD_GATEWAY = 528, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_NOT_IMPLEMENTED implicitly + 1)
    CALL_FAIL_SIP_SERVICE_UNAVAILABLE = 529, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_BAD_GATEWAY implicitly + 1)
    CALL_FAIL_SIP_SERVER_TIMEOUT = 530, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVICE_UNAVAILABLE implicitly + 1)
    CALL_FAIL_SIP_SERVER_VERSION_UNSUPPORTED = 531, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_TIMEOUT implicitly + 1)
    CALL_FAIL_SIP_SERVER_MESSAGE_TOOLARGE = 532, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_VERSION_UNSUPPORTED implicitly + 1)
    CALL_FAIL_SIP_SERVER_PRECONDITION_FAILURE = 533, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_MESSAGE_TOOLARGE implicitly + 1)
    CALL_FAIL_SIP_USER_REJECTED = 534, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_PRECONDITION_FAILURE implicitly + 1)
    CALL_FAIL_SIP_GLOBAL_ERROR = 535, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_USER_REJECTED implicitly + 1)
    CALL_FAIL_MEDIA_INIT_FAILED = 536, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_GLOBAL_ERROR implicitly + 1)
    CALL_FAIL_MEDIA_NO_DATA = 537, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_INIT_FAILED implicitly + 1)
    CALL_FAIL_MEDIA_NOT_ACCEPTABLE = 538, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_NO_DATA implicitly + 1)
    CALL_FAIL_MEDIA_UNSPECIFIED_ERROR = 539, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_NOT_ACCEPTABLE implicitly + 1)
    CALL_FAIL_HOLD_RESUME_FAILED = 540, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_UNSPECIFIED_ERROR implicitly + 1)
    CALL_FAIL_HOLD_RESUME_CANCELED = 541, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_RESUME_FAILED implicitly + 1)
    CALL_FAIL_HOLD_REINVITE_COLLISION = 542, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_RESUME_CANCELED implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_DIAL_VIDEO = 543, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_REINVITE_COLLISION implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL = 544, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_DIAL_VIDEO implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL_VIDEO = 545, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_SS = 546, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL_VIDEO implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_USSD = 547, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_SS implicitly + 1)
    CALL_FAIL_ERROR_UNSPECIFIED = 548, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_USSD implicitly + 1)
    CALL_FAIL_INVALID = 549, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ERROR_UNSPECIFIED implicitly + 1)
    CALL_FAIL_SIP_ALTERNATE_EMERGENCY_CALL = 550, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_INVALID implicitly + 1)
};

struct CallFailCauseResponse final {
    ::vendor::qti::hardware::radio::ims::V1_1::CallFailCause failCause __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> errorinfo __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string networkErrorString __attribute__ ((aligned(8)));
    bool hasErrorDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo errorDetails __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallFailCauseResponse, failCause) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallFailCauseResponse, errorinfo) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallFailCauseResponse, networkErrorString) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallFailCauseResponse, hasErrorDetails) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallFailCauseResponse, errorDetails) == 48, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_1::CallFailCauseResponse) == 72, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_1::CallFailCauseResponse) == 8, "wrong alignment");

struct HangupRequestInfo final {
    int32_t connIndex __attribute__ ((aligned(4)));
    bool hasMultiParty __attribute__ ((aligned(1)));
    bool multiParty __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string connUri __attribute__ ((aligned(8)));
    uint32_t conf_id __attribute__ ((aligned(4)));
    bool hasFailCauseResponse __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_1::CallFailCauseResponse failCauseResponse __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::HangupRequestInfo, connIndex) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::HangupRequestInfo, hasMultiParty) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::HangupRequestInfo, multiParty) == 5, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::HangupRequestInfo, connUri) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::HangupRequestInfo, conf_id) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::HangupRequestInfo, hasFailCauseResponse) == 28, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::HangupRequestInfo, failCauseResponse) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_1::HangupRequestInfo) == 104, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_1::HangupRequestInfo) == 8, "wrong alignment");

struct CallInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::CallState state __attribute__ ((aligned(4)));
    uint32_t index __attribute__ ((aligned(4)));
    uint32_t toa __attribute__ ((aligned(4)));
    bool hasIsMpty __attribute__ ((aligned(1)));
    bool isMpty __attribute__ ((aligned(1)));
    bool hasIsMT __attribute__ ((aligned(1)));
    bool isMT __attribute__ ((aligned(1)));
    uint32_t als __attribute__ ((aligned(4)));
    bool hasIsVoice __attribute__ ((aligned(1)));
    bool isVoice __attribute__ ((aligned(1)));
    bool hasIsVoicePrivacy __attribute__ ((aligned(1)));
    bool isVoicePrivacy __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    uint32_t numberPresentation __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    uint32_t namePresentation __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallDetails callDetails __attribute__ ((aligned(8)));
    bool hasFailCause __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_1::CallFailCauseResponse failCause __attribute__ ((aligned(8)));
    bool hasIsEncrypted __attribute__ ((aligned(1)));
    bool isEncrypted __attribute__ ((aligned(1)));
    bool hasIsCalledPartyRinging __attribute__ ((aligned(1)));
    bool isCalledPartyRinging __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string historyInfo __attribute__ ((aligned(8)));
    bool hasIsVideoConfSupported __attribute__ ((aligned(1)));
    bool isVideoConfSupported __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, state) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, index) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, toa) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, hasIsMpty) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, isMpty) == 13, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, hasIsMT) == 14, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, isMT) == 15, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, als) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, hasIsVoice) == 20, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, isVoice) == 21, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, hasIsVoicePrivacy) == 22, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, isVoicePrivacy) == 23, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, number) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, numberPresentation) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, name) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, namePresentation) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, hasCallDetails) == 68, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, callDetails) == 72, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, hasFailCause) == 168, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, failCause) == 176, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, hasIsEncrypted) == 248, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, isEncrypted) == 249, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, hasIsCalledPartyRinging) == 250, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, isCalledPartyRinging) == 251, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, historyInfo) == 256, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, hasIsVideoConfSupported) == 272, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo, isVideoConfSupported) == 273, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo) == 280, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_1::CallInfo) == 8, "wrong alignment");

constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_1::CallFailCause lhs, const ::vendor::qti::hardware::radio::ims::V1_1::CallFailCause rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}

constexpr int32_t operator|(const int32_t lhs, const ::vendor::qti::hardware::radio::ims::V1_1::CallFailCause rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}

constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_1::CallFailCause lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}

constexpr int32_t operator&(const ::vendor::qti::hardware::radio::ims::V1_1::CallFailCause lhs, const ::vendor::qti::hardware::radio::ims::V1_1::CallFailCause rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) & static_cast<int32_t>(rhs));
}

