/*
  Copyright (c) 2018 Qualcomm Technologies, Inc.
  All Rights Reserved.
  Confidential and Proprietary - Qualcomm Technologies, Inc.
*/
#ifndef HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_2_TYPES_H
#define HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_2_TYPES_H

#include <vendor/qti/hardware/radio/ims/1.0/types.h>
#include <vendor/qti/hardware/radio/ims/1.1/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace qti {
namespace hardware {
namespace radio {
namespace ims {
namespace V1_2 {

// Forward declaration for forward reference support:
enum class CallFailCause : int32_t;
struct CallFailCauseResponse;
struct HangupRequestInfo;
struct CallInfo;
enum class ImsSmsSendStatusResult : int32_t;
enum class ImsSmsSendFailureReason : int32_t;
enum class ImsSmsDeliverStatusResult : int32_t;
enum class ImsSmsStatusReportResult : int32_t;
enum class VerificationStatus : int32_t;
struct ImsSmsMessage;
struct ImsSmsSendStatusReport;
struct IncomingImsSms;
struct AddressInfo;

enum class CallFailCause : int32_t {
    CALL_FAIL_UNOBTAINABLE_NUMBER = 0,
    CALL_FAIL_NORMAL = 1, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_UNOBTAINABLE_NUMBER implicitly + 1)
    CALL_FAIL_BUSY = 2, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NORMAL implicitly + 1)
    CALL_FAIL_NORMAL_UNSPECIFIED = 3, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_BUSY implicitly + 1)
    CALL_FAIL_CONGESTION = 4, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NORMAL_UNSPECIFIED implicitly + 1)
    CALL_FAIL_INCOMPATIBILITY_DESTINATION = 5, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CONGESTION implicitly + 1)
    CALL_FAIL_CALL_BARRED = 6, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_INCOMPATIBILITY_DESTINATION implicitly + 1)
    CALL_FAIL_FDN_BLOCKED = 7, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CALL_BARRED implicitly + 1)
    CALL_FAIL_IMEI_NOT_ACCEPTED = 8, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_FDN_BLOCKED implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_USSD = 9, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_IMEI_NOT_ACCEPTED implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_SS = 10, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_USSD implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_DIAL = 11, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_SS implicitly + 1)
    CALL_FAIL_EMERGENCY_TEMP_FAILURE = 12, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_DIAL implicitly + 1)
    CALL_FAIL_EMERGENCY_PERM_FAILURE = 13, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_EMERGENCY_TEMP_FAILURE implicitly + 1)
    CALL_FAIL_HO_NOT_FEASIBLE = 14, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_EMERGENCY_PERM_FAILURE implicitly + 1)
    CALL_FAIL_USER_BUSY = 501,
    CALL_FAIL_USER_REJECT = 502,
    CALL_FAIL_LOW_BATTERY = 503,
    CALL_FAIL_BLACKLISTED_CALL_ID = 504, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_LOW_BATTERY implicitly + 1)
    CALL_FAIL_CS_RETRY_REQUIRED = 505, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_BLACKLISTED_CALL_ID implicitly + 1)
    CALL_FAIL_NETWORK_UNAVAILABLE = 506, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CS_RETRY_REQUIRED implicitly + 1)
    CALL_FAIL_FEATURE_UNAVAILABLE = 507, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NETWORK_UNAVAILABLE implicitly + 1)
    CALL_FAIL_SIP_ERROR = 508, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_FEATURE_UNAVAILABLE implicitly + 1)
    CALL_FAIL_MISC = 509, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_ERROR implicitly + 1)
    CALL_FAIL_ANSWERED_ELSEWHERE = 510, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MISC implicitly + 1)
    CALL_FAIL_PULL_OUT_OF_SYNC = 511, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ANSWERED_ELSEWHERE implicitly + 1)
    CALL_FAIL_CAUSE_CALL_PULLED = 512, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_PULL_OUT_OF_SYNC implicitly + 1)
    CALL_FAIL_ACCESS_CLASS_BLOCKED = 513, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CAUSE_CALL_PULLED implicitly + 1)
    CALL_FAIL_SIP_REDIRECTED = 514, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ACCESS_CLASS_BLOCKED implicitly + 1)
    CALL_FAIL_SIP_BAD_REQUEST = 515, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REDIRECTED implicitly + 1)
    CALL_FAIL_SIP_FORBIDDEN = 516, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BAD_REQUEST implicitly + 1)
    CALL_FAIL_SIP_NOT_FOUND = 517, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_FORBIDDEN implicitly + 1)
    CALL_FAIL_SIP_NOT_SUPPORTED = 518, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_FOUND implicitly + 1)
    CALL_FAIL_SIP_REQUEST_TIMEOUT = 519, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_SUPPORTED implicitly + 1)
    CALL_FAIL_SIP_TEMPORARILY_UNAVAILABLE = 520, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REQUEST_TIMEOUT implicitly + 1)
    CALL_FAIL_SIP_BAD_ADDRESS = 521, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_TEMPORARILY_UNAVAILABLE implicitly + 1)
    CALL_FAIL_SIP_BUSY = 522, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BAD_ADDRESS implicitly + 1)
    CALL_FAIL_SIP_REQUEST_CANCELLED = 523, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BUSY implicitly + 1)
    CALL_FAIL_SIP_NOT_ACCEPTABLE = 524, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REQUEST_CANCELLED implicitly + 1)
    CALL_FAIL_SIP_NOT_REACHABLE = 525, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_ACCEPTABLE implicitly + 1)
    CALL_FAIL_SIP_SERVER_INTERNAL_ERROR = 526, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_REACHABLE implicitly + 1)
    CALL_FAIL_SIP_SERVER_NOT_IMPLEMENTED = 527, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_INTERNAL_ERROR implicitly + 1)
    CALL_FAIL_SIP_SERVER_BAD_GATEWAY = 528, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_NOT_IMPLEMENTED implicitly + 1)
    CALL_FAIL_SIP_SERVICE_UNAVAILABLE = 529, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_BAD_GATEWAY implicitly + 1)
    CALL_FAIL_SIP_SERVER_TIMEOUT = 530, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVICE_UNAVAILABLE implicitly + 1)
    CALL_FAIL_SIP_SERVER_VERSION_UNSUPPORTED = 531, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_TIMEOUT implicitly + 1)
    CALL_FAIL_SIP_SERVER_MESSAGE_TOOLARGE = 532, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_VERSION_UNSUPPORTED implicitly + 1)
    CALL_FAIL_SIP_SERVER_PRECONDITION_FAILURE = 533, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_MESSAGE_TOOLARGE implicitly + 1)
    CALL_FAIL_SIP_USER_REJECTED = 534, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_PRECONDITION_FAILURE implicitly + 1)
    CALL_FAIL_SIP_GLOBAL_ERROR = 535, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_USER_REJECTED implicitly + 1)
    CALL_FAIL_MEDIA_INIT_FAILED = 536, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_GLOBAL_ERROR implicitly + 1)
    CALL_FAIL_MEDIA_NO_DATA = 537, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_INIT_FAILED implicitly + 1)
    CALL_FAIL_MEDIA_NOT_ACCEPTABLE = 538, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_NO_DATA implicitly + 1)
    CALL_FAIL_MEDIA_UNSPECIFIED_ERROR = 539, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_NOT_ACCEPTABLE implicitly + 1)
    CALL_FAIL_HOLD_RESUME_FAILED = 540, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_UNSPECIFIED_ERROR implicitly + 1)
    CALL_FAIL_HOLD_RESUME_CANCELED = 541, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_RESUME_FAILED implicitly + 1)
    CALL_FAIL_HOLD_REINVITE_COLLISION = 542, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_RESUME_CANCELED implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_DIAL_VIDEO = 543, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_REINVITE_COLLISION implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL = 544, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_DIAL_VIDEO implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL_VIDEO = 545, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_SS = 546, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL_VIDEO implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_USSD = 547, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_SS implicitly + 1)
    CALL_FAIL_ERROR_UNSPECIFIED = 548, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_USSD implicitly + 1)
    CALL_FAIL_INVALID = 549, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ERROR_UNSPECIFIED implicitly + 1)
    CALL_FAIL_SIP_ALTERNATE_EMERGENCY_CALL = 550, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_INVALID implicitly + 1)
    CALL_FAIL_RADIO_OFF = 551, // (::vendor::qti::hardware::radio::ims::V1_1::CallFailCause.CALL_FAIL_SIP_ALTERNATE_EMERGENCY_CALL implicitly + 1)
    CALL_FAIL_OUT_OF_SERVICE = 552, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_OFF implicitly + 1)
    CALL_FAIL_NO_VALID_SIM = 553, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OUT_OF_SERVICE implicitly + 1)
    CALL_FAIL_RADIO_INTERNAL_ERROR = 554, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_NO_VALID_SIM implicitly + 1)
    CALL_FAIL_NETWORK_RESP_TIMEOUT = 555, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_INTERNAL_ERROR implicitly + 1)
    CALL_FAIL_NETWORK_REJECT = 556, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_NETWORK_RESP_TIMEOUT implicitly + 1)
    CALL_FAIL_RADIO_ACCESS_FAILURE = 557, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_NETWORK_REJECT implicitly + 1)
    CALL_FAIL_RADIO_LINK_FAILURE = 558, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_ACCESS_FAILURE implicitly + 1)
    CALL_FAIL_RADIO_LINK_LOST = 559, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_LINK_FAILURE implicitly + 1)
    CALL_FAIL_RADIO_UPLINK_FAILURE = 560, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_LINK_LOST implicitly + 1)
    CALL_FAIL_RADIO_SETUP_FAILURE = 561, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_UPLINK_FAILURE implicitly + 1)
    CALL_FAIL_RADIO_RELEASE_NORMAL = 562, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_SETUP_FAILURE implicitly + 1)
    CALL_FAIL_RADIO_RELEASE_ABNORMAL = 563, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_RELEASE_NORMAL implicitly + 1)
    CALL_FAIL_NETWORK_DETACH = 564, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_RADIO_RELEASE_ABNORMAL implicitly + 1)
    CALL_FAIL_OEM_CAUSE_1 = 565, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_NETWORK_DETACH implicitly + 1)
    CALL_FAIL_OEM_CAUSE_2 = 566, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_1 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_3 = 567, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_2 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_4 = 568, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_3 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_5 = 569, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_4 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_6 = 570, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_5 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_7 = 571, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_6 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_8 = 572, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_7 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_9 = 573, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_8 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_10 = 574, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_9 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_11 = 575, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_10 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_12 = 576, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_11 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_13 = 577, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_12 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_14 = 578, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_13 implicitly + 1)
    CALL_FAIL_OEM_CAUSE_15 = 579, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_14 implicitly + 1)
    CALL_FAIL_NO_CSFB_IN_CS_ROAM = 580, // (::vendor::qti::hardware::radio::ims::V1_2::CallFailCause.CALL_FAIL_OEM_CAUSE_15 implicitly + 1)
};

struct CallFailCauseResponse final {
    ::vendor::qti::hardware::radio::ims::V1_2::CallFailCause failCause __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> errorinfo __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string networkErrorString __attribute__ ((aligned(8)));
    bool hasErrorDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo errorDetails __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallFailCauseResponse, failCause) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallFailCauseResponse, errorinfo) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallFailCauseResponse, networkErrorString) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallFailCauseResponse, hasErrorDetails) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallFailCauseResponse, errorDetails) == 48, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_2::CallFailCauseResponse) == 72, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_2::CallFailCauseResponse) == 8, "wrong alignment");

struct HangupRequestInfo final {
    int32_t connIndex __attribute__ ((aligned(4)));
    bool hasMultiParty __attribute__ ((aligned(1)));
    bool multiParty __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string connUri __attribute__ ((aligned(8)));
    uint32_t conf_id __attribute__ ((aligned(4)));
    bool hasFailCauseResponse __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_2::CallFailCauseResponse failCauseResponse __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::HangupRequestInfo, connIndex) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::HangupRequestInfo, hasMultiParty) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::HangupRequestInfo, multiParty) == 5, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::HangupRequestInfo, connUri) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::HangupRequestInfo, conf_id) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::HangupRequestInfo, hasFailCauseResponse) == 28, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::HangupRequestInfo, failCauseResponse) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_2::HangupRequestInfo) == 104, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_2::HangupRequestInfo) == 8, "wrong alignment");

struct CallInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::CallState state __attribute__ ((aligned(4)));
    uint32_t index __attribute__ ((aligned(4)));
    uint32_t toa __attribute__ ((aligned(4)));
    bool hasIsMpty __attribute__ ((aligned(1)));
    bool isMpty __attribute__ ((aligned(1)));
    bool hasIsMT __attribute__ ((aligned(1)));
    bool isMT __attribute__ ((aligned(1)));
    uint32_t als __attribute__ ((aligned(4)));
    bool hasIsVoice __attribute__ ((aligned(1)));
    bool isVoice __attribute__ ((aligned(1)));
    bool hasIsVoicePrivacy __attribute__ ((aligned(1)));
    bool isVoicePrivacy __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    uint32_t numberPresentation __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    uint32_t namePresentation __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallDetails callDetails __attribute__ ((aligned(8)));
    bool hasFailCause __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_2::CallFailCauseResponse failCause __attribute__ ((aligned(8)));
    bool hasIsEncrypted __attribute__ ((aligned(1)));
    bool isEncrypted __attribute__ ((aligned(1)));
    bool hasIsCalledPartyRinging __attribute__ ((aligned(1)));
    bool isCalledPartyRinging __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string historyInfo __attribute__ ((aligned(8)));
    bool hasIsVideoConfSupported __attribute__ ((aligned(1)));
    bool isVideoConfSupported __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, state) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, index) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, toa) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, hasIsMpty) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, isMpty) == 13, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, hasIsMT) == 14, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, isMT) == 15, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, als) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, hasIsVoice) == 20, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, isVoice) == 21, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, hasIsVoicePrivacy) == 22, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, isVoicePrivacy) == 23, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, number) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, numberPresentation) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, name) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, namePresentation) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, hasCallDetails) == 68, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, callDetails) == 72, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, hasFailCause) == 168, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, failCause) == 176, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, hasIsEncrypted) == 248, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, isEncrypted) == 249, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, hasIsCalledPartyRinging) == 250, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, isCalledPartyRinging) == 251, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, historyInfo) == 256, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, hasIsVideoConfSupported) == 272, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo, isVideoConfSupported) == 273, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo) == 280, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_2::CallInfo) == 8, "wrong alignment");

enum class ImsSmsSendStatusResult : int32_t {
    /**
     * Message was sent successfully.  */
    SEND_STATUS_OK = 0,
    /**
     * IMS provider failed to send the message and platform
     * should not retry falling back to sending the message
     * using the radio.  */
    SEND_STATUS_ERROR = 1, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendStatusResult.SEND_STATUS_OK implicitly + 1)
    /**
     * IMS provider failed to send the message and platform
     * should retry again after setting TP-RD  */
    SEND_STATUS_ERROR_RETRY = 2, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendStatusResult.SEND_STATUS_ERROR implicitly + 1)
    /**
     * IMS provider failed to send the message and platform
     * should retry falling back to sending the message
     * using the radio.  */
    SEND_STATUS_ERROR_FALLBACK = 3, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendStatusResult.SEND_STATUS_ERROR_RETRY implicitly + 1)
};

enum class ImsSmsSendFailureReason : int32_t {
    RESULT_ERROR_NONE = 0,
    /**
     * Generic failure cause  */
    RESULT_ERROR_GENERIC_FAILURE = 1, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_NONE implicitly + 1)
    /**
     * Failed because radio was explicitly turned off  */
    RESULT_ERROR_RADIO_OFF = 2, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_GENERIC_FAILURE implicitly + 1)
    /**
     * Failed because no pdu provided  */
    RESULT_ERROR_NULL_PDU = 3, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_RADIO_OFF implicitly + 1)
    /**
     * Failed because service is currently unavailable  */
    RESULT_ERROR_NO_SERVICE = 4, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_NULL_PDU implicitly + 1)
    /**
     * Failed because we reached the sending queue limit.  */
    RESULT_ERROR_LIMIT_EXCEEDED = 5, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_NO_SERVICE implicitly + 1)
    /**
     * Failed because user denied the sending of this short code.  */
    RESULT_ERROR_SHORT_CODE_NOT_ALLOWED = 6, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_LIMIT_EXCEEDED implicitly + 1)
    /**
     * Failed because the user has denied this app
     * ever send premium short codes.  */
    RESULT_ERROR_SHORT_CODE_NEVER_ALLOWED = 7, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendFailureReason.RESULT_ERROR_SHORT_CODE_NOT_ALLOWED implicitly + 1)
};

enum class ImsSmsDeliverStatusResult : int32_t {
    /**
     * Message was delivered successfully.  */
    DELIVER_STATUS_OK = 0,
    /**
     * Message was not delivered.  */
    DELIVER_STATUS_ERROR = 1, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsDeliverStatusResult.DELIVER_STATUS_OK implicitly + 1)
};

enum class ImsSmsStatusReportResult : int32_t {
    /**
     * Status Report was set successfully.  */
    STATUS_REPORT_STATUS_OK = 0,
    /**
     * Error while setting status report  */
    STATUS_REPORT_STATUS_ERROR = 1, // (::vendor::qti::hardware::radio::ims::V1_2::ImsSmsStatusReportResult.STATUS_REPORT_STATUS_OK implicitly + 1)
};

enum class VerificationStatus : int32_t {
    /**
     * Telephone number is not validated.  */
    STATUS_VALIDATION_NONE = 0,
    /**
     * Telephone number validation passed.  */
    STATUS_VALIDATION_PASS = 1, // (::vendor::qti::hardware::radio::ims::V1_2::VerificationStatus.STATUS_VALIDATION_NONE implicitly + 1)
    /**
     * Telephone number validation failed.  */
    STATUS_VALIDATION_FAIL = 2, // (::vendor::qti::hardware::radio::ims::V1_2::VerificationStatus.STATUS_VALIDATION_PASS implicitly + 1)
};

struct ImsSmsMessage final {
    uint32_t messageRef __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string format __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string smsc __attribute__ ((aligned(8)));
    bool shallRetry __attribute__ ((aligned(1)));
    ::android::hardware::hidl_vec<uint8_t> pdu __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsMessage, messageRef) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsMessage, format) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsMessage, smsc) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsMessage, shallRetry) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsMessage, pdu) == 48, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsMessage) == 64, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsMessage) == 8, "wrong alignment");

struct ImsSmsSendStatusReport final {
    uint32_t messageRef __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string format __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<uint8_t> pdu __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendStatusReport, messageRef) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendStatusReport, format) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendStatusReport, pdu) == 24, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendStatusReport) == 40, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_2::ImsSmsSendStatusReport) == 8, "wrong alignment");

struct IncomingImsSms final {
    ::android::hardware::hidl_string format __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<uint8_t> pdu __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_2::VerificationStatus verstat __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::IncomingImsSms, format) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::IncomingImsSms, pdu) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::IncomingImsSms, verstat) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_2::IncomingImsSms) == 40, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_2::IncomingImsSms) == 8, "wrong alignment");

struct AddressInfo final {
    ::android::hardware::hidl_string city __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string state __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string country __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string postalCode __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string countryCode __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string street __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string houseNumber __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::AddressInfo, city) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::AddressInfo, state) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::AddressInfo, country) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::AddressInfo, postalCode) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::AddressInfo, countryCode) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::AddressInfo, street) == 80, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_2::AddressInfo, houseNumber) == 96, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_2::AddressInfo) == 112, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_2::AddressInfo) == 8, "wrong alignment");

constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_2::CallFailCause lhs, const ::vendor::qti::hardware::radio::ims::V1_2::CallFailCause rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}

constexpr int32_t operator|(const int32_t lhs, const ::vendor::qti::hardware::radio::ims::V1_2::CallFailCause rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}

constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_2::CallFailCause lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}

constexpr int32_t operator&(const ::vendor::qti::hardware::radio::ims::V1_2::CallFailCause lhs, const ::vendor::qti::hardware::radio::ims::V1_2::CallFailCause rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) & static_cast<int32_t>(rhs));
}

