#ifndef HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_2_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_2_TYPES_H

#include <android/hardware/radio/1.0/types.h>
#include <android/hardware/radio/1.1/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace radio {
namespace V1_2 {

// Forward declaration for forward reference support:
enum class RadioConst : int32_t;
enum class ScanIntervalRange : int32_t;
enum class MaxSearchTimeRange : int32_t;
enum class IncrementalResultsPeriodicityRange : int32_t;
enum class CellConnectionStatus : int32_t;
enum class IndicationFilter : int32_t;
enum class AudioQuality : int32_t;
struct NetworkScanRequest;
struct NetworkScanResult;
struct CellIdentityOperatorNames;
struct CellIdentityCdma;
struct CellIdentityGsm;
struct CellIdentityLte;
struct CellIdentityTdscdma;
struct CellIdentityWcdma;
struct CellInfoGsm;
struct WcdmaSignalStrength;
struct CellInfoWcdma;
struct CellInfoCdma;
struct CellInfoLte;
struct TdscdmaSignalStrength;
struct CellInfoTdscdma;
struct CellInfo;
struct CardStatus;
struct LinkCapacityEstimate;
struct PhysicalChannelConfig;
enum class AccessNetwork : int32_t;
enum class DataRequestReason : int32_t;
struct Call;
struct SignalStrength;
struct CellIdentity;
struct VoiceRegStateResult;
struct DataRegStateResult;

// Order of inner types was changed for forward reference support.

enum class RadioConst : int32_t {
    CDMA_ALPHA_INFO_BUFFER_LENGTH = 64,
    CDMA_NUMBER_INFO_BUFFER_LENGTH = 81,
    MAX_RILDS = 3,
    MAX_SOCKET_NAME_LENGTH = 6,
    MAX_CLIENT_ID_LENGTH = 2,
    MAX_DEBUG_SOCKET_NAME_LENGTH = 12,
    MAX_QEMU_PIPE_NAME_LENGTH = 11,
    MAX_UUID_LENGTH = 64,
    CARD_MAX_APPS = 8,
    CDMA_MAX_NUMBER_OF_INFO_RECS = 10,
    SS_INFO_MAX = 4,
    NUM_SERVICE_CLASSES = 7,
    NUM_TX_POWER_LEVELS = 5,
    RADIO_ACCESS_SPECIFIER_MAX_SIZE = 8,
};

/**
 * values are in seconds
 */
enum class ScanIntervalRange : int32_t {
    MIN = 5,
    MAX = 300,
};

/**
 * value are in seconds
 */
enum class MaxSearchTimeRange : int32_t {
    MIN = 60,
    MAX = 3600,
};

/**
 * values are in seconds
 */
enum class IncrementalResultsPeriodicityRange : int32_t {
    MIN = 1,
    MAX = 10,
};

enum class CellConnectionStatus : int32_t {
    /**
     * Cell is not a serving cell.
     */
    NONE = 0,
    /**
     * UE has connection to cell for signalling and possibly data (3GPP 36.331, 25.331).
     */
    PRIMARY_SERVING = 1, // (::android::hardware::radio::V1_2::CellConnectionStatus.NONE implicitly + 1)
    /**
     * UE has connection to cell for data (3GPP 36.331, 25.331).
     */
    SECONDARY_SERVING = 2, // (::android::hardware::radio::V1_2::CellConnectionStatus.PRIMARY_SERVING implicitly + 1)
};

/**
 * Overwritten from @1.0::IndicationFilter in order to redefine ALL. In the future, this should
 * be extended instead of overwritten.
 */
enum class IndicationFilter : int32_t {
    NONE = 0,
    ALL = -1, // (~0)
    /**
     * When this bit is set, modem must send the signal strength update through
     * IRadioIndication.currentSignalStrength() when all criteria specified by
     * IRadio.setSignalStrengthReportingCriteria() are met.
     */
    SIGNAL_STRENGTH = 1, // (1 << 0)
    /**
     * When this bit is set, modem must invoke IRadioIndication.networkStateChanged() when any field
     * in VoiceRegStateResult or DataRegStateResult changes. When this bit is not set, modem must
     * suppress IRadioIndication.networkStateChanged() when there are only changes from
     * insignificant fields. Modem must invoke IRadioIndication.networkStateChanged() when
     * significant fields are updated regardless of whether this bit is set.
     * 
     * The following fields are considered significant: VoiceRegStateResult.regState,
     * VoiceRegStateResult.rat, DataRegStateResult.regState, DataRegStateResult.rat.
     */
    FULL_NETWORK_STATE = 2, // (1 << 1)
    /**
     * When this bit is set, modem must send IRadioIndication.dataCallListChanged() whenever any
     * field in ITypes.SetupDataCallResult changes. When this bit is not set, modem must suppress
     * the indication when the only changed field is 'active' (for data dormancy). For all other
     * field changes, the modem must send IRadioIndication.dataCallListChanged() regardless of
     * whether this bit is set.
     */
    DATA_CALL_DORMANCY_CHANGED = 4, // (1 << 2)
    /**
     * When this bit is set, modem must send the link capacity update through
     * IRadioIndication.currentLinkCapacityEstimate() when all criteria specified by
     * IRadio.setLinkCapacityReportingCriteria() are met.
     */
    LINK_CAPACITY_ESTIMATE = 8, // (1 << 3)
    /**
     * When this bit is set, the modem must send the physical channel configuration update through
     * IRadioIndication.currentPhysicalChannelConfigs() when the configuration has changed. It is
     * recommended that this be reported whenever link capacity or signal strength is reported.
     */
    PHYSICAL_CHANNEL_CONFIG = 16, // (1 << 4)
};

/**
 * Audio codec which is used on GSM, UMTS, and CDMA. These values must be opaque
 * to the Android framework. Only for display.
 */
enum class AudioQuality : int32_t {
    /**
     * Unspecified audio codec  */
    UNSPECIFIED = 0,
    /**
     * AMR (Narrowband) audio codec  */
    AMR = 1, // (::android::hardware::radio::V1_2::AudioQuality.UNSPECIFIED implicitly + 1)
    /**
     * AMR (Wideband) audio codec  */
    AMR_WB = 2, // (::android::hardware::radio::V1_2::AudioQuality.AMR implicitly + 1)
    /**
     * GSM Enhanced Full-Rate audio codec  */
    GSM_EFR = 3, // (::android::hardware::radio::V1_2::AudioQuality.AMR_WB implicitly + 1)
    /**
     * GSM Full-Rate audio codec  */
    GSM_FR = 4, // (::android::hardware::radio::V1_2::AudioQuality.GSM_EFR implicitly + 1)
    /**
     * GSM Half-Rate audio codec  */
    GSM_HR = 5, // (::android::hardware::radio::V1_2::AudioQuality.GSM_FR implicitly + 1)
    /**
     * Enhanced Variable rate codec  */
    EVRC = 6, // (::android::hardware::radio::V1_2::AudioQuality.GSM_HR implicitly + 1)
    /**
     * Enhanced Variable rate codec revision B  */
    EVRC_B = 7, // (::android::hardware::radio::V1_2::AudioQuality.EVRC implicitly + 1)
    /**
     * Enhanced Variable rate codec (Wideband)  */
    EVRC_WB = 8, // (::android::hardware::radio::V1_2::AudioQuality.EVRC_B implicitly + 1)
    /**
     * Enhanced Variable rate codec (Narrowband)  */
    EVRC_NW = 9, // (::android::hardware::radio::V1_2::AudioQuality.EVRC_WB implicitly + 1)
};

struct NetworkScanRequest final {
    ::android::hardware::radio::V1_1::ScanType type __attribute__ ((aligned(4)));
    int32_t interval __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_1::RadioAccessSpecifier> specifiers __attribute__ ((aligned(8)));
    int32_t maxSearchTime __attribute__ ((aligned(4)));
    bool incrementalResults __attribute__ ((aligned(1)));
    int32_t incrementalResultsPeriodicity __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> mccMncs __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, interval) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, specifiers) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, maxSearchTime) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, incrementalResults) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, incrementalResultsPeriodicity) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanRequest, mccMncs) == 40, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::NetworkScanRequest) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::NetworkScanRequest) == 8, "wrong alignment");

struct NetworkScanResult final {
    ::android::hardware::radio::V1_1::ScanStatus status __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::RadioError error __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfo> networkInfos __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanResult, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanResult, error) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::NetworkScanResult, networkInfos) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::NetworkScanResult) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::NetworkScanResult) == 8, "wrong alignment");

struct CellIdentityOperatorNames final {
    ::android::hardware::hidl_string alphaLong __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string alphaShort __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityOperatorNames, alphaLong) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityOperatorNames, alphaShort) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityOperatorNames) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityOperatorNames) == 8, "wrong alignment");

struct CellIdentityCdma final {
    ::android::hardware::radio::V1_0::CellIdentityCdma base __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityCdma, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityCdma, operatorNames) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityCdma) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityCdma) == 8, "wrong alignment");

struct CellIdentityGsm final {
    ::android::hardware::radio::V1_0::CellIdentityGsm base __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityGsm, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityGsm, operatorNames) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityGsm) == 80, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityGsm) == 8, "wrong alignment");

struct CellIdentityLte final {
    ::android::hardware::radio::V1_0::CellIdentityLte base __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
    int32_t bandwidth __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityLte, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityLte, operatorNames) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityLte, bandwidth) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityLte) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityLte) == 8, "wrong alignment");

struct CellIdentityTdscdma final {
    ::android::hardware::radio::V1_0::CellIdentityTdscdma base __attribute__ ((aligned(8)));
    int32_t uarfcn __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityTdscdma, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityTdscdma, uarfcn) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityTdscdma, operatorNames) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityTdscdma) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityTdscdma) == 8, "wrong alignment");

struct CellIdentityWcdma final {
    ::android::hardware::radio::V1_0::CellIdentityWcdma base __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::CellIdentityOperatorNames operatorNames __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityWcdma, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentityWcdma, operatorNames) == 48, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentityWcdma) == 80, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentityWcdma) == 8, "wrong alignment");

struct CellInfoGsm final {
    ::android::hardware::radio::V1_2::CellIdentityGsm cellIdentityGsm __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::GsmSignalStrength signalStrengthGsm __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoGsm, cellIdentityGsm) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoGsm, signalStrengthGsm) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfoGsm) == 96, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfoGsm) == 8, "wrong alignment");

struct WcdmaSignalStrength final {
    ::android::hardware::radio::V1_0::WcdmaSignalStrength base __attribute__ ((aligned(4)));
    uint32_t rscp __attribute__ ((aligned(4)));
    uint32_t ecno __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::WcdmaSignalStrength, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::WcdmaSignalStrength, rscp) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::WcdmaSignalStrength, ecno) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::WcdmaSignalStrength) == 16, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::WcdmaSignalStrength) == 4, "wrong alignment");

struct CellInfoWcdma final {
    ::android::hardware::radio::V1_2::CellIdentityWcdma cellIdentityWcdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::WcdmaSignalStrength signalStrengthWcdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoWcdma, cellIdentityWcdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoWcdma, signalStrengthWcdma) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfoWcdma) == 96, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfoWcdma) == 8, "wrong alignment");

struct CellInfoCdma final {
    ::android::hardware::radio::V1_2::CellIdentityCdma cellIdentityCdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::CdmaSignalStrength signalStrengthCdma __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::EvdoSignalStrength signalStrengthEvdo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoCdma, cellIdentityCdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoCdma, signalStrengthCdma) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoCdma, signalStrengthEvdo) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfoCdma) == 80, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfoCdma) == 8, "wrong alignment");

struct CellInfoLte final {
    ::android::hardware::radio::V1_2::CellIdentityLte cellIdentityLte __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_0::LteSignalStrength signalStrengthLte __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoLte, cellIdentityLte) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoLte, signalStrengthLte) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfoLte) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfoLte) == 8, "wrong alignment");

struct TdscdmaSignalStrength final {
    uint32_t signalStrength __attribute__ ((aligned(4)));
    uint32_t bitErrorRate __attribute__ ((aligned(4)));
    uint32_t rscp __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::TdscdmaSignalStrength, signalStrength) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::TdscdmaSignalStrength, bitErrorRate) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::TdscdmaSignalStrength, rscp) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::TdscdmaSignalStrength) == 12, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::TdscdmaSignalStrength) == 4, "wrong alignment");

struct CellInfoTdscdma final {
    ::android::hardware::radio::V1_2::CellIdentityTdscdma cellIdentityTdscdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::TdscdmaSignalStrength signalStrengthTdscdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoTdscdma, cellIdentityTdscdma) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfoTdscdma, signalStrengthTdscdma) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfoTdscdma) == 104, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfoTdscdma) == 8, "wrong alignment");

struct CellInfo final {
    ::android::hardware::radio::V1_0::CellInfoType cellInfoType __attribute__ ((aligned(4)));
    bool registered __attribute__ ((aligned(1)));
    ::android::hardware::radio::V1_0::TimeStampType timeStampType __attribute__ ((aligned(4)));
    uint64_t timeStamp __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfoGsm> gsm __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfoCdma> cdma __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfoLte> lte __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfoWcdma> wcdma __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellInfoTdscdma> tdscdma __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::CellConnectionStatus connectionStatus __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, cellInfoType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, registered) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, timeStampType) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, timeStamp) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, gsm) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, cdma) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, lte) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, wcdma) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, tdscdma) == 88, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellInfo, connectionStatus) == 104, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellInfo) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellInfo) == 8, "wrong alignment");

struct CardStatus final {
    ::android::hardware::radio::V1_0::CardStatus base __attribute__ ((aligned(8)));
    uint32_t physicalSlotId __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string atr __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string iccid __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CardStatus, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CardStatus, physicalSlotId) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CardStatus, atr) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CardStatus, iccid) == 64, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CardStatus) == 80, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CardStatus) == 8, "wrong alignment");

struct LinkCapacityEstimate final {
    uint32_t downlinkCapacityKbps __attribute__ ((aligned(4)));
    uint32_t uplinkCapacityKbps __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::LinkCapacityEstimate, downlinkCapacityKbps) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::LinkCapacityEstimate, uplinkCapacityKbps) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::LinkCapacityEstimate) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::LinkCapacityEstimate) == 4, "wrong alignment");

struct PhysicalChannelConfig final {
    ::android::hardware::radio::V1_2::CellConnectionStatus status __attribute__ ((aligned(4)));
    int32_t cellBandwidthDownlink __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::PhysicalChannelConfig, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::PhysicalChannelConfig, cellBandwidthDownlink) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::PhysicalChannelConfig) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::PhysicalChannelConfig) == 4, "wrong alignment");

enum class AccessNetwork : int32_t {
    /**
     * GSM EDGE Radio Access Network  */
    GERAN = 1,
    /**
     * Universal Terrestrial Radio Access Network  */
    UTRAN = 2,
    /**
     * Evolved Universal Terrestrial Radio Access Network  */
    EUTRAN = 3,
    /**
     * CDMA 2000 network  */
    CDMA2000 = 4,
    /**
     * Interworking Wireless LAN  */
    IWLAN = 5,
};

enum class DataRequestReason : int32_t {
    /**
     * The reason of the data request is normal
     */
    NORMAL = 1,
    /**
     * The reason of the data request is device shutdown
     */
    SHUTDOWN = 2,
    /**
     * The reason of the data request is IWLAN data handover to another transport
     * (e.g. from cellular to wifi or vise versa)
     */
    HANDOVER = 3,
};

struct Call final {
    ::android::hardware::radio::V1_0::Call base __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_2::AudioQuality audioQuality __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::Call, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::Call, audioQuality) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::Call) == 96, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::Call) == 8, "wrong alignment");

struct SignalStrength final {
    ::android::hardware::radio::V1_0::GsmSignalStrength gsm __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::CdmaSignalStrength cdma __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::EvdoSignalStrength evdo __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::LteSignalStrength lte __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_0::TdScdmaSignalStrength tdScdma __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_2::WcdmaSignalStrength wcdma __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, gsm) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, cdma) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, evdo) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, lte) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, tdScdma) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::SignalStrength, wcdma) == 60, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::SignalStrength) == 76, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::SignalStrength) == 4, "wrong alignment");

struct CellIdentity final {
    ::android::hardware::radio::V1_0::CellInfoType cellInfoType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellIdentityGsm> cellIdentityGsm __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellIdentityWcdma> cellIdentityWcdma __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellIdentityCdma> cellIdentityCdma __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellIdentityLte> cellIdentityLte __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_2::CellIdentityTdscdma> cellIdentityTdscdma __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellInfoType) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellIdentityGsm) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellIdentityWcdma) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellIdentityCdma) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellIdentityLte) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::CellIdentity, cellIdentityTdscdma) == 72, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::CellIdentity) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::CellIdentity) == 8, "wrong alignment");

struct VoiceRegStateResult final {
    ::android::hardware::radio::V1_0::RegState regState __attribute__ ((aligned(4)));
    int32_t rat __attribute__ ((aligned(4)));
    bool cssSupported __attribute__ ((aligned(1)));
    int32_t roamingIndicator __attribute__ ((aligned(4)));
    int32_t systemIsInPrl __attribute__ ((aligned(4)));
    int32_t defaultRoamingIndicator __attribute__ ((aligned(4)));
    int32_t reasonForDenial __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_2::CellIdentity cellIdentity __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, regState) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, rat) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, cssSupported) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, roamingIndicator) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, systemIsInPrl) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, defaultRoamingIndicator) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, reasonForDenial) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::VoiceRegStateResult, cellIdentity) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::VoiceRegStateResult) == 120, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::VoiceRegStateResult) == 8, "wrong alignment");

struct DataRegStateResult final {
    ::android::hardware::radio::V1_0::RegState regState __attribute__ ((aligned(4)));
    int32_t rat __attribute__ ((aligned(4)));
    int32_t reasonDataDenied __attribute__ ((aligned(4)));
    int32_t maxDataCalls __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_2::CellIdentity cellIdentity __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_2::DataRegStateResult, regState) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::DataRegStateResult, rat) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::DataRegStateResult, reasonDataDenied) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::DataRegStateResult, maxDataCalls) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_2::DataRegStateResult, cellIdentity) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_2::DataRegStateResult) == 104, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_2::DataRegStateResult) == 8, "wrong alignment");

constexpr int32_t operator|(const ::android::hardware::radio::V1_2::RadioConst lhs, const ::android::hardware::radio::V1_2::RadioConst rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}

constexpr int32_t operator|(const int32_t lhs, const ::android::hardware::radio::V1_2::RadioConst rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}

constexpr int32_t operator|(const ::android::hardware::radio::V1_2::RadioConst lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}

constexpr int32_t operator&(const ::android::hardware::radio::V1_2::RadioConst lhs, const ::android::hardware::radio::V1_2::RadioConst rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) & static_cast<int32_t>(rhs));
}

