/******************************************************************************
#  Copyright (c) 2018 Qualcomm Technologies, Inc.
#  All Rights Reserved.
#  Confidential and Proprietary - Qualcomm Technologies, Inc.
#******************************************************************************/

#ifndef HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_0_TYPES_H
#define HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_0_TYPES_H

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace qti {
namespace hardware {
namespace radio {
namespace ims {
namespace V1_0 {

// Forward declaration for forward reference support:
enum class IpPresentation : int32_t;
enum class CallType : int32_t;
enum class CallDomain : int32_t;
enum class CallFailCause : int32_t;
enum class RegState : int32_t;
enum class StatusType : int32_t;
enum class RadioTechType : int32_t;
enum class ConfigItem : int32_t;
enum class ConfigFailureCause : int32_t;
enum class ToneOperation : int32_t;
enum class HandoverType : int32_t;
enum class CallState : int32_t;
enum class ServiceType : int32_t;
enum class ExtraType : int32_t;
enum class RadioState : int32_t;
enum class ServiceClassStatus : int32_t;
enum class FacilityType : int32_t;
enum class ClipStatus : int32_t;
enum class TtyMode : int32_t;
enum class ConferenceCallState : int32_t;
enum class CallModifyFailCause : int32_t;
enum class NotificationType : int32_t;
enum class MessageType : int32_t;
enum class MessagePriority : int32_t;
enum class EctType : int32_t;
enum class ConfParticipantOperation : int32_t;
enum class BlockReasonType : int32_t;
enum class RegFailureReasonType : int32_t;
enum class RttMode : int32_t;
struct RegistrationInfo;
struct StatusForAccessTech;
struct ServiceStatusInfo;
struct CallDetails;
struct DialRequest;
struct SipErrorInfo;
struct CallFailCauseResponse;
struct HangupRequestInfo;
struct ConfigInfo;
struct Extra;
struct HandoverInfo;
struct CallInfo;
struct CbNumInfo;
struct CbNumListInfo;
struct SuppServiceStatus;
struct ClipProvisionStatus;
struct ClirInfo;
struct ColrInfo;
struct DtmfInfo;
struct TtyInfo;
struct ConferenceInfo;
struct ViceInfo;
struct CallModifyInfo;
struct CallFwdTimerInfo;
struct CallForwardInfo;
struct SuppServiceNotification;
struct ExplicitCallTransferInfo;
struct MessageSummary;
struct MessageDetails;
struct MessageWaitingIndication;
struct DeflectRequestInfo;
struct AddressInfo;
struct ImsSubConfigInfo;
struct ParticipantStatusInfo;
struct BlockReasonDetails;
struct BlockStatus;
enum class VoWiFiCallQualityInfo : int32_t;
enum class SsServiceType : int32_t;
enum class SsRequestType : int32_t;
enum class SsTeleserviceType : int32_t;
struct CfData;
struct SsInfoData;
struct StkCcUnsolSsResult;

enum class IpPresentation : int32_t {
    IP_PRESENTATION_NUM_ALLOWED = 0,
    IP_PRESENTATION_NUM_RESTRICTED = 1, // (::vendor::qti::hardware::radio::ims::V1_0::IpPresentation.IP_PRESENTATION_NUM_ALLOWED implicitly + 1)
    IP_PRESENTATION_NUM_DEFAULT = 2, // (::vendor::qti::hardware::radio::ims::V1_0::IpPresentation.IP_PRESENTATION_NUM_RESTRICTED implicitly + 1)
    IP_PRESENTATION_INVALID = 3, // (::vendor::qti::hardware::radio::ims::V1_0::IpPresentation.IP_PRESENTATION_NUM_DEFAULT implicitly + 1)
};

enum class CallType : int32_t {
    CALL_TYPE_VOICE = 0,
    CALL_TYPE_VT_TX = 1, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_VOICE implicitly + 1)
    CALL_TYPE_VT_RX = 2, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_VT_TX implicitly + 1)
    CALL_TYPE_VT = 3, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_VT_RX implicitly + 1)
    CALL_TYPE_VT_NODIR = 4, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_VT implicitly + 1)
    CALL_TYPE_CS_VS_TX = 5, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_VT_NODIR implicitly + 1)
    CALL_TYPE_CS_VS_RX = 6, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_CS_VS_TX implicitly + 1)
    CALL_TYPE_PS_VS_TX = 7, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_CS_VS_RX implicitly + 1)
    CALL_TYPE_PS_VS_RX = 8, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_PS_VS_TX implicitly + 1)
    CALL_TYPE_UNKNOWN = 9, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_PS_VS_RX implicitly + 1)
    CALL_TYPE_SMS = 10, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_UNKNOWN implicitly + 1)
    CALL_TYPE_UT = 11, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_SMS implicitly + 1)
    CALL_TYPE_INVALID = 12, // (::vendor::qti::hardware::radio::ims::V1_0::CallType.CALL_TYPE_UT implicitly + 1)
};

enum class CallDomain : int32_t {
    CALL_DOMAIN_UNKNOWN = 0,
    CALL_DOMAIN_CS = 1, // (::vendor::qti::hardware::radio::ims::V1_0::CallDomain.CALL_DOMAIN_UNKNOWN implicitly + 1)
    CALL_DOMAIN_PS = 2, // (::vendor::qti::hardware::radio::ims::V1_0::CallDomain.CALL_DOMAIN_CS implicitly + 1)
    CALL_DOMAIN_AUTOMATIC = 3, // (::vendor::qti::hardware::radio::ims::V1_0::CallDomain.CALL_DOMAIN_PS implicitly + 1)
    CALL_DOMAIN_NOT_SET = 4, // (::vendor::qti::hardware::radio::ims::V1_0::CallDomain.CALL_DOMAIN_AUTOMATIC implicitly + 1)
    CALL_DOMAIN_INVALID = 5, // (::vendor::qti::hardware::radio::ims::V1_0::CallDomain.CALL_DOMAIN_NOT_SET implicitly + 1)
};

enum class CallFailCause : int32_t {
    CALL_FAIL_UNOBTAINABLE_NUMBER = 0,
    CALL_FAIL_NORMAL = 1, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_UNOBTAINABLE_NUMBER implicitly + 1)
    CALL_FAIL_BUSY = 2, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NORMAL implicitly + 1)
    CALL_FAIL_NORMAL_UNSPECIFIED = 3, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_BUSY implicitly + 1)
    CALL_FAIL_CONGESTION = 4, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NORMAL_UNSPECIFIED implicitly + 1)
    CALL_FAIL_INCOMPATIBILITY_DESTINATION = 5, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CONGESTION implicitly + 1)
    CALL_FAIL_CALL_BARRED = 6, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_INCOMPATIBILITY_DESTINATION implicitly + 1)
    CALL_FAIL_FDN_BLOCKED = 7, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CALL_BARRED implicitly + 1)
    CALL_FAIL_IMEI_NOT_ACCEPTED = 8, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_FDN_BLOCKED implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_USSD = 9, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_IMEI_NOT_ACCEPTED implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_SS = 10, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_USSD implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_DIAL = 11, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_SS implicitly + 1)
    CALL_FAIL_EMERGENCY_TEMP_FAILURE = 12, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_DIAL implicitly + 1)
    CALL_FAIL_EMERGENCY_PERM_FAILURE = 13, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_EMERGENCY_TEMP_FAILURE implicitly + 1)
    CALL_FAIL_HO_NOT_FEASIBLE = 14, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_EMERGENCY_PERM_FAILURE implicitly + 1)
    CALL_FAIL_USER_BUSY = 501,
    CALL_FAIL_USER_REJECT = 502,
    CALL_FAIL_LOW_BATTERY = 503,
    CALL_FAIL_BLACKLISTED_CALL_ID = 504, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_LOW_BATTERY implicitly + 1)
    CALL_FAIL_CS_RETRY_REQUIRED = 505, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_BLACKLISTED_CALL_ID implicitly + 1)
    CALL_FAIL_NETWORK_UNAVAILABLE = 506, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CS_RETRY_REQUIRED implicitly + 1)
    CALL_FAIL_FEATURE_UNAVAILABLE = 507, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_NETWORK_UNAVAILABLE implicitly + 1)
    CALL_FAIL_SIP_ERROR = 508, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_FEATURE_UNAVAILABLE implicitly + 1)
    CALL_FAIL_MISC = 509, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_ERROR implicitly + 1)
    CALL_FAIL_ANSWERED_ELSEWHERE = 510, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MISC implicitly + 1)
    CALL_FAIL_PULL_OUT_OF_SYNC = 511, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ANSWERED_ELSEWHERE implicitly + 1)
    CALL_FAIL_CAUSE_CALL_PULLED = 512, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_PULL_OUT_OF_SYNC implicitly + 1)
    CALL_FAIL_ACCESS_CLASS_BLOCKED = 513, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_CAUSE_CALL_PULLED implicitly + 1)
    CALL_FAIL_SIP_REDIRECTED = 514, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ACCESS_CLASS_BLOCKED implicitly + 1)
    CALL_FAIL_SIP_BAD_REQUEST = 515, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REDIRECTED implicitly + 1)
    CALL_FAIL_SIP_FORBIDDEN = 516, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BAD_REQUEST implicitly + 1)
    CALL_FAIL_SIP_NOT_FOUND = 517, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_FORBIDDEN implicitly + 1)
    CALL_FAIL_SIP_NOT_SUPPORTED = 518, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_FOUND implicitly + 1)
    CALL_FAIL_SIP_REQUEST_TIMEOUT = 519, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_SUPPORTED implicitly + 1)
    CALL_FAIL_SIP_TEMPORARILY_UNAVAILABLE = 520, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REQUEST_TIMEOUT implicitly + 1)
    CALL_FAIL_SIP_BAD_ADDRESS = 521, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_TEMPORARILY_UNAVAILABLE implicitly + 1)
    CALL_FAIL_SIP_BUSY = 522, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BAD_ADDRESS implicitly + 1)
    CALL_FAIL_SIP_REQUEST_CANCELLED = 523, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_BUSY implicitly + 1)
    CALL_FAIL_SIP_NOT_ACCEPTABLE = 524, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_REQUEST_CANCELLED implicitly + 1)
    CALL_FAIL_SIP_NOT_REACHABLE = 525, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_ACCEPTABLE implicitly + 1)
    CALL_FAIL_SIP_SERVER_INTERNAL_ERROR = 526, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_NOT_REACHABLE implicitly + 1)
    CALL_FAIL_SIP_SERVER_NOT_IMPLEMENTED = 527, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_INTERNAL_ERROR implicitly + 1)
    CALL_FAIL_SIP_SERVER_BAD_GATEWAY = 528, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_NOT_IMPLEMENTED implicitly + 1)
    CALL_FAIL_SIP_SERVICE_UNAVAILABLE = 529, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_BAD_GATEWAY implicitly + 1)
    CALL_FAIL_SIP_SERVER_TIMEOUT = 530, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVICE_UNAVAILABLE implicitly + 1)
    CALL_FAIL_SIP_SERVER_VERSION_UNSUPPORTED = 531, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_TIMEOUT implicitly + 1)
    CALL_FAIL_SIP_SERVER_MESSAGE_TOOLARGE = 532, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_VERSION_UNSUPPORTED implicitly + 1)
    CALL_FAIL_SIP_SERVER_PRECONDITION_FAILURE = 533, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_MESSAGE_TOOLARGE implicitly + 1)
    CALL_FAIL_SIP_USER_REJECTED = 534, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_SERVER_PRECONDITION_FAILURE implicitly + 1)
    CALL_FAIL_SIP_GLOBAL_ERROR = 535, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_USER_REJECTED implicitly + 1)
    CALL_FAIL_MEDIA_INIT_FAILED = 536, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_SIP_GLOBAL_ERROR implicitly + 1)
    CALL_FAIL_MEDIA_NO_DATA = 537, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_INIT_FAILED implicitly + 1)
    CALL_FAIL_MEDIA_NOT_ACCEPTABLE = 538, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_NO_DATA implicitly + 1)
    CALL_FAIL_MEDIA_UNSPECIFIED_ERROR = 539, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_NOT_ACCEPTABLE implicitly + 1)
    CALL_FAIL_HOLD_RESUME_FAILED = 540, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_MEDIA_UNSPECIFIED_ERROR implicitly + 1)
    CALL_FAIL_HOLD_RESUME_CANCELED = 541, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_RESUME_FAILED implicitly + 1)
    CALL_FAIL_HOLD_REINVITE_COLLISION = 542, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_RESUME_CANCELED implicitly + 1)
    CALL_FAIL_DIAL_MODIFIED_TO_DIAL_VIDEO = 543, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_HOLD_REINVITE_COLLISION implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL = 544, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_MODIFIED_TO_DIAL_VIDEO implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL_VIDEO = 545, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_SS = 546, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_DIAL_VIDEO implicitly + 1)
    CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_USSD = 547, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_SS implicitly + 1)
    CALL_FAIL_ERROR_UNSPECIFIED = 548, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_DIAL_VIDEO_MODIFIED_TO_USSD implicitly + 1)
    CALL_FAIL_INVALID = 549, // (::vendor::qti::hardware::radio::ims::V1_0::CallFailCause.CALL_FAIL_ERROR_UNSPECIFIED implicitly + 1)
};

enum class RegState : int32_t {
    REGISTERED = 0,
    NOT_REGISTERED = 1, // (::vendor::qti::hardware::radio::ims::V1_0::RegState.REGISTERED implicitly + 1)
    REGISTERING = 2, // (::vendor::qti::hardware::radio::ims::V1_0::RegState.NOT_REGISTERED implicitly + 1)
    INVALID = 3, // (::vendor::qti::hardware::radio::ims::V1_0::RegState.REGISTERING implicitly + 1)
};

enum class StatusType : int32_t {
    STATUS_DISABLED = 0,
    STATUS_PARTIALLY_ENABLED = 1, // (::vendor::qti::hardware::radio::ims::V1_0::StatusType.STATUS_DISABLED implicitly + 1)
    STATUS_ENABLED = 2, // (::vendor::qti::hardware::radio::ims::V1_0::StatusType.STATUS_PARTIALLY_ENABLED implicitly + 1)
    STATUS_NOT_SUPPORTED = 3, // (::vendor::qti::hardware::radio::ims::V1_0::StatusType.STATUS_ENABLED implicitly + 1)
    STATUS_INVALID = 4, // (::vendor::qti::hardware::radio::ims::V1_0::StatusType.STATUS_NOT_SUPPORTED implicitly + 1)
};

enum class RadioTechType : int32_t {
    RADIO_TECH_ANY = 0,
    RADIO_TECH_UNKNOWN = 1, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_ANY implicitly + 1)
    RADIO_TECH_GPRS = 2, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_UNKNOWN implicitly + 1)
    RADIO_TECH_EDGE = 3, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_GPRS implicitly + 1)
    RADIO_TECH_UMTS = 4, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_EDGE implicitly + 1)
    RADIO_TECH_IS95A = 5, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_UMTS implicitly + 1)
    RADIO_TECH_IS95B = 6, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_IS95A implicitly + 1)
    RADIO_TECH_1xRTT = 7, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_IS95B implicitly + 1)
    RADIO_TECH_EVDO_0 = 8, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_1xRTT implicitly + 1)
    RADIO_TECH_EVDO_A = 9, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_EVDO_0 implicitly + 1)
    RADIO_TECH_HSDPA = 10, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_EVDO_A implicitly + 1)
    RADIO_TECH_HSUPA = 11, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_HSDPA implicitly + 1)
    RADIO_TECH_HSPA = 12, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_HSUPA implicitly + 1)
    RADIO_TECH_EVDO_B = 13, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_HSPA implicitly + 1)
    RADIO_TECH_EHRPD = 14, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_EVDO_B implicitly + 1)
    RADIO_TECH_LTE = 15, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_EHRPD implicitly + 1)
    RADIO_TECH_HSPAP = 16, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_LTE implicitly + 1)
    RADIO_TECH_GSM = 17, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_HSPAP implicitly + 1)
    RADIO_TECH_TD_SCDMA = 18, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_GSM implicitly + 1)
    RADIO_TECH_WIFI = 19, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_TD_SCDMA implicitly + 1)
    RADIO_TECH_IWLAN = 20, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_WIFI implicitly + 1)
    RADIO_TECH_INVALID = 21, // (::vendor::qti::hardware::radio::ims::V1_0::RadioTechType.RADIO_TECH_IWLAN implicitly + 1)
};

enum class ConfigItem : int32_t {
    CONFIG_ITEM_NONE = 0,
    CONFIG_ITEM_VOCODER_AMRMODESET = 1, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_NONE implicitly + 1)
    CONFIG_ITEM_VOCODER_AMRWBMODESET = 2, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOCODER_AMRMODESET implicitly + 1)
    CONFIG_ITEM_SIP_SESSION_TIMER = 3, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOCODER_AMRWBMODESET implicitly + 1)
    CONFIG_ITEM_MIN_SESSION_EXPIRY = 4, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_SESSION_TIMER implicitly + 1)
    CONFIG_ITEM_CANCELLATION_TIMER = 5, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_MIN_SESSION_EXPIRY implicitly + 1)
    CONFIG_ITEM_T_DELAY = 6, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CANCELLATION_TIMER implicitly + 1)
    CONFIG_ITEM_SILENT_REDIAL_ENABLE = 7, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_DELAY implicitly + 1)
    CONFIG_ITEM_SIP_T1_TIMER = 8, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SILENT_REDIAL_ENABLE implicitly + 1)
    CONFIG_ITEM_SIP_T2_TIMER = 9, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_T1_TIMER implicitly + 1)
    CONFIG_ITEM_SIP_TF_TIMER = 10, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_T2_TIMER implicitly + 1)
    CONFIG_ITEM_VLT_SETTING_ENABLED = 11, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_TF_TIMER implicitly + 1)
    CONFIG_ITEM_LVC_SETTING_ENABLED = 12, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VLT_SETTING_ENABLED implicitly + 1)
    CONFIG_ITEM_DOMAIN_NAME = 13, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_LVC_SETTING_ENABLED implicitly + 1)
    CONFIG_ITEM_SMS_FORMAT = 14, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_DOMAIN_NAME implicitly + 1)
    CONFIG_ITEM_SMS_OVER_IP = 15, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_FORMAT implicitly + 1)
    CONFIG_ITEM_PUBLISH_TIMER = 16, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_OVER_IP implicitly + 1)
    CONFIG_ITEM_PUBLISH_TIMER_EXTENDED = 17, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_PUBLISH_TIMER implicitly + 1)
    CONFIG_ITEM_CAPABILITIES_CACHE_EXPIRATION = 18, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_PUBLISH_TIMER_EXTENDED implicitly + 1)
    CONFIG_ITEM_AVAILABILITY_CACHE_EXPIRATION = 19, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPABILITIES_CACHE_EXPIRATION implicitly + 1)
    CONFIG_ITEM_CAPABILITIES_POLL_INTERVAL = 20, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AVAILABILITY_CACHE_EXPIRATION implicitly + 1)
    CONFIG_ITEM_SOURCE_THROTTLE_PUBLISH = 21, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPABILITIES_POLL_INTERVAL implicitly + 1)
    CONFIG_ITEM_MAX_NUM_ENTRIES_IN_RCL = 22, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SOURCE_THROTTLE_PUBLISH implicitly + 1)
    CONFIG_ITEM_CAPAB_POLL_LIST_SUB_EXP = 23, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_MAX_NUM_ENTRIES_IN_RCL implicitly + 1)
    CONFIG_ITEM_GZIP_FLAG = 24, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPAB_POLL_LIST_SUB_EXP implicitly + 1)
    CONFIG_ITEM_EAB_SETTING_ENABLED = 25, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_GZIP_FLAG implicitly + 1)
    CONFIG_ITEM_MOBILE_DATA_ENABLED = 26, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_EAB_SETTING_ENABLED implicitly + 1)
    CONFIG_ITEM_VOICE_OVER_WIFI_ENABLED = 27, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_MOBILE_DATA_ENABLED implicitly + 1)
    CONFIG_ITEM_VOICE_OVER_WIFI_ROAMING = 28, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOICE_OVER_WIFI_ENABLED implicitly + 1)
    CONFIG_ITEM_VOICE_OVER_WIFI_MODE = 29, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOICE_OVER_WIFI_ROAMING implicitly + 1)
    CONFIG_ITEM_CAPABILITY_DISCOVERY_ENABLED = 30, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOICE_OVER_WIFI_MODE implicitly + 1)
    CONFIG_ITEM_EMERGENCY_CALL_TIMER = 31, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_CAPABILITY_DISCOVERY_ENABLED implicitly + 1)
    CONFIG_ITEM_SSAC_HYSTERESIS_TIMER = 32, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_EMERGENCY_CALL_TIMER implicitly + 1)
    CONFIG_ITEM_VOLTE_USER_OPT_IN_STATUS = 33, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SSAC_HYSTERESIS_TIMER implicitly + 1)
    CONFIG_ITEM_LBO_PCSCF_ADDRESS = 34, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VOLTE_USER_OPT_IN_STATUS implicitly + 1)
    CONFIG_ITEM_KEEP_ALIVE_ENABLED = 35, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_LBO_PCSCF_ADDRESS implicitly + 1)
    CONFIG_ITEM_REGISTRATION_RETRY_BASE_TIME_SEC = 36, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_KEEP_ALIVE_ENABLED implicitly + 1)
    CONFIG_ITEM_REGISTRATION_RETRY_MAX_TIME_SEC = 37, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_REGISTRATION_RETRY_BASE_TIME_SEC implicitly + 1)
    CONFIG_ITEM_SPEECH_START_PORT = 38, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_REGISTRATION_RETRY_MAX_TIME_SEC implicitly + 1)
    CONFIG_ITEM_SPEECH_END_PORT = 39, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SPEECH_START_PORT implicitly + 1)
    CONFIG_ITEM_SIP_INVITE_REQ_RETX_INTERVAL_MSEC = 40, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SPEECH_END_PORT implicitly + 1)
    CONFIG_ITEM_SIP_INVITE_RSP_WAIT_TIME_MSEC = 41, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_REQ_RETX_INTERVAL_MSEC implicitly + 1)
    CONFIG_ITEM_SIP_INVITE_RSP_RETX_WAIT_TIME_MSEC = 42, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_RSP_WAIT_TIME_MSEC implicitly + 1)
    CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_INTERVAL_MSEC = 43, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_RSP_RETX_WAIT_TIME_MSEC implicitly + 1)
    CONFIG_ITEM_SIP_NON_INVITE_TXN_TIMEOUT_TIMER_MSEC = 44, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_INTERVAL_MSEC implicitly + 1)
    CONFIG_ITEM_SIP_INVITE_RSP_RETX_INTERVAL_MSEC = 45, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_TXN_TIMEOUT_TIMER_MSEC implicitly + 1)
    CONFIG_ITEM_SIP_ACK_RECEIPT_WAIT_TIME_MSEC = 46, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_INVITE_RSP_RETX_INTERVAL_MSEC implicitly + 1)
    CONFIG_ITEM_SIP_ACK_RETX_WAIT_TIME_MSEC = 47, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_ACK_RECEIPT_WAIT_TIME_MSEC implicitly + 1)
    CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_WAIT_TIME_MSEC = 48, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_ACK_RETX_WAIT_TIME_MSEC implicitly + 1)
    CONFIG_ITEM_SIP_NON_INVITE_RSP_RETX_WAIT_TIME_MSEC = 49, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_REQ_RETX_WAIT_TIME_MSEC implicitly + 1)
    CONFIG_ITEM_AMR_WB_OCTET_ALIGNED_PT = 50, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SIP_NON_INVITE_RSP_RETX_WAIT_TIME_MSEC implicitly + 1)
    CONFIG_ITEM_AMR_WB_BANDWIDTH_EFFICIENT_PT = 51, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_WB_OCTET_ALIGNED_PT implicitly + 1)
    CONFIG_ITEM_AMR_OCTET_ALIGNED_PT = 52, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_WB_BANDWIDTH_EFFICIENT_PT implicitly + 1)
    CONFIG_ITEM_AMR_BANDWIDTH_EFFICIENT_PT = 53, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_OCTET_ALIGNED_PT implicitly + 1)
    CONFIG_ITEM_DTMF_WB_PT = 54, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_BANDWIDTH_EFFICIENT_PT implicitly + 1)
    CONFIG_ITEM_DTMF_NB_PT = 55, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_DTMF_WB_PT implicitly + 1)
    CONFIG_ITEM_AMR_DEFAULT_MODE = 56, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_DTMF_NB_PT implicitly + 1)
    CONFIG_ITEM_SMS_PSI = 57, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_AMR_DEFAULT_MODE implicitly + 1)
    CONFIG_ITEM_VIDEO_QUALITY = 58, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_PSI implicitly + 1)
    CONFIG_ITEM_THRESHOLD_LTE1 = 59, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VIDEO_QUALITY implicitly + 1)
    CONFIG_ITEM_THRESHOLD_LTE2 = 60, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_LTE1 implicitly + 1)
    CONFIG_ITEM_THRESHOLD_LTE3 = 61, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_LTE2 implicitly + 1)
    CONFIG_ITEM_THRESHOLD_1x = 62, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_LTE3 implicitly + 1)
    CONFIG_ITEM_THRESHOLD_WIFI_A = 63, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_1x implicitly + 1)
    CONFIG_ITEM_THRESHOLD_WIFI_B = 64, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_WIFI_A implicitly + 1)
    CONFIG_ITEM_T_EPDG_LTE = 65, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_THRESHOLD_WIFI_B implicitly + 1)
    CONFIG_ITEM_T_EPDG_WIFI = 66, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_EPDG_LTE implicitly + 1)
    CONFIG_ITEM_T_EPDG_1x = 67, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_EPDG_WIFI implicitly + 1)
    CONFIG_ITEM_VWF_SETTING_ENABLED = 68, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_T_EPDG_1x implicitly + 1)
    CONFIG_ITEM_VCE_SETTING_ENABLED = 69, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VWF_SETTING_ENABLED implicitly + 1)
    CONFIG_ITEM_RTT_SETTING_ENABLED = 70, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VCE_SETTING_ENABLED implicitly + 1)
    CONFIG_ITEM_SMS_APP = 71, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_RTT_SETTING_ENABLED implicitly + 1)
    CONFIG_ITEM_VVM_APP = 72, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_SMS_APP implicitly + 1)
    CONFIG_ITEM_INVALID = 73, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigItem.CONFIG_ITEM_VVM_APP implicitly + 1)
};

enum class ConfigFailureCause : int32_t {
    CONFIG_NO_ERR = 0,
    CONFIG_IMS_NOT_READY = 1, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigFailureCause.CONFIG_NO_ERR implicitly + 1)
    CONFIG_FILE_NOT_AVAILABLE = 2, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigFailureCause.CONFIG_IMS_NOT_READY implicitly + 1)
    CONFIG_READ_FAILED = 3, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigFailureCause.CONFIG_FILE_NOT_AVAILABLE implicitly + 1)
    CONFIG_WRITE_FAILED = 4, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigFailureCause.CONFIG_READ_FAILED implicitly + 1)
    CONFIG_OTHER_INTERNAL_ERR = 5, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigFailureCause.CONFIG_WRITE_FAILED implicitly + 1)
    CONFIG_FAILURE_INVALID = 6, // (::vendor::qti::hardware::radio::ims::V1_0::ConfigFailureCause.CONFIG_OTHER_INTERNAL_ERR implicitly + 1)
};

enum class ToneOperation : int32_t {
    STOP = 0,
    START = 1, // (::vendor::qti::hardware::radio::ims::V1_0::ToneOperation.STOP implicitly + 1)
    INVALID = 2, // (::vendor::qti::hardware::radio::ims::V1_0::ToneOperation.START implicitly + 1)
};

enum class HandoverType : int32_t {
    START = 0,
    COMPLETE_SUCCESS = 1, // (::vendor::qti::hardware::radio::ims::V1_0::HandoverType.START implicitly + 1)
    COMPLETE_FAIL = 2, // (::vendor::qti::hardware::radio::ims::V1_0::HandoverType.COMPLETE_SUCCESS implicitly + 1)
    CANCEL = 3, // (::vendor::qti::hardware::radio::ims::V1_0::HandoverType.COMPLETE_FAIL implicitly + 1)
    NOT_TRIGGERED = 4, // (::vendor::qti::hardware::radio::ims::V1_0::HandoverType.CANCEL implicitly + 1)
    NOT_TRIGGERED_MOBILE_DATA_OFF = 5, // (::vendor::qti::hardware::radio::ims::V1_0::HandoverType.NOT_TRIGGERED implicitly + 1)
    INVALID = 6, // (::vendor::qti::hardware::radio::ims::V1_0::HandoverType.NOT_TRIGGERED_MOBILE_DATA_OFF implicitly + 1)
};

enum class CallState : int32_t {
    CALL_ACTIVE = 0,
    CALL_HOLDING = 1, // (::vendor::qti::hardware::radio::ims::V1_0::CallState.CALL_ACTIVE implicitly + 1)
    CALL_DIALING = 2, // (::vendor::qti::hardware::radio::ims::V1_0::CallState.CALL_HOLDING implicitly + 1)
    CALL_ALERTING = 3, // (::vendor::qti::hardware::radio::ims::V1_0::CallState.CALL_DIALING implicitly + 1)
    CALL_INCOMING = 4, // (::vendor::qti::hardware::radio::ims::V1_0::CallState.CALL_ALERTING implicitly + 1)
    CALL_WAITING = 5, // (::vendor::qti::hardware::radio::ims::V1_0::CallState.CALL_INCOMING implicitly + 1)
    CALL_END = 6, // (::vendor::qti::hardware::radio::ims::V1_0::CallState.CALL_WAITING implicitly + 1)
    CALL_STATE_INVALID = 7, // (::vendor::qti::hardware::radio::ims::V1_0::CallState.CALL_END implicitly + 1)
};

enum class ServiceType : int32_t {
    SMS = 0,
    VOIP = 1, // (::vendor::qti::hardware::radio::ims::V1_0::ServiceType.SMS implicitly + 1)
    VT = 2, // (::vendor::qti::hardware::radio::ims::V1_0::ServiceType.VOIP implicitly + 1)
    INVALID = 3, // (::vendor::qti::hardware::radio::ims::V1_0::ServiceType.VT implicitly + 1)
};

enum class ExtraType : int32_t {
    LTE_TO_IWLAN_HO_FAIL = 0,
    INVALID = 1, // (::vendor::qti::hardware::radio::ims::V1_0::ExtraType.LTE_TO_IWLAN_HO_FAIL implicitly + 1)
};

enum class RadioState : int32_t {
    RADIO_STATE_OFF = 0,
    RADIO_STATE_UNAVAILABLE = 1, // (::vendor::qti::hardware::radio::ims::V1_0::RadioState.RADIO_STATE_OFF implicitly + 1)
    RADIO_STATE_ON = 2, // (::vendor::qti::hardware::radio::ims::V1_0::RadioState.RADIO_STATE_UNAVAILABLE implicitly + 1)
    RADIO_STATE_INVALID = 3, // (::vendor::qti::hardware::radio::ims::V1_0::RadioState.RADIO_STATE_ON implicitly + 1)
};

enum class ServiceClassStatus : int32_t {
    DISABLED = 0,
    ENABLED = 1, // (::vendor::qti::hardware::radio::ims::V1_0::ServiceClassStatus.DISABLED implicitly + 1)
    INVALID = 2, // (::vendor::qti::hardware::radio::ims::V1_0::ServiceClassStatus.ENABLED implicitly + 1)
};

enum class FacilityType : int32_t {
    FACILITY_CLIP = 0,
    FACILITY_COLP = 1, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_CLIP implicitly + 1)
    FACILITY_BAOC = 2, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_COLP implicitly + 1)
    FACILITY_BAOIC = 3, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_BAOC implicitly + 1)
    FACILITY_BAOICxH = 4, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_BAOIC implicitly + 1)
    FACILITY_BAIC = 5, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_BAOICxH implicitly + 1)
    FACILITY_BAICr = 6, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_BAIC implicitly + 1)
    FACILITY_BA_ALL = 7, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_BAICr implicitly + 1)
    FACILITY_BA_MO = 8, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_BA_ALL implicitly + 1)
    FACILITY_BA_MT = 9, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_BA_MO implicitly + 1)
    FACILITY_BS_MT = 10, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_BA_MT implicitly + 1)
    FACILITY_BAICa = 11, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_BS_MT implicitly + 1)
    FACILITY_INVALID = 12, // (::vendor::qti::hardware::radio::ims::V1_0::FacilityType.FACILITY_BAICa implicitly + 1)
};

enum class ClipStatus : int32_t {
    NOT_PROVISIONED = 0,
    PROVISIONED = 1, // (::vendor::qti::hardware::radio::ims::V1_0::ClipStatus.NOT_PROVISIONED implicitly + 1)
    STATUS_UNKNOWN = 2, // (::vendor::qti::hardware::radio::ims::V1_0::ClipStatus.PROVISIONED implicitly + 1)
    INVALID = 3, // (::vendor::qti::hardware::radio::ims::V1_0::ClipStatus.STATUS_UNKNOWN implicitly + 1)
};

enum class TtyMode : int32_t {
    TTY_MODE_OFF = 0,
    TTY_MODE_FULL = 1, // (::vendor::qti::hardware::radio::ims::V1_0::TtyMode.TTY_MODE_OFF implicitly + 1)
    TTY_MODE_HCO = 2, // (::vendor::qti::hardware::radio::ims::V1_0::TtyMode.TTY_MODE_FULL implicitly + 1)
    TTY_MODE_VCO = 3, // (::vendor::qti::hardware::radio::ims::V1_0::TtyMode.TTY_MODE_HCO implicitly + 1)
    TTY_MODE_INVALID = 4, // (::vendor::qti::hardware::radio::ims::V1_0::TtyMode.TTY_MODE_VCO implicitly + 1)
};

enum class ConferenceCallState : int32_t {
    RINGING = 0,
    FOREGROUND = 1, // (::vendor::qti::hardware::radio::ims::V1_0::ConferenceCallState.RINGING implicitly + 1)
    BACKGROUND = 2, // (::vendor::qti::hardware::radio::ims::V1_0::ConferenceCallState.FOREGROUND implicitly + 1)
    INVALID = 3, // (::vendor::qti::hardware::radio::ims::V1_0::ConferenceCallState.BACKGROUND implicitly + 1)
};

enum class CallModifyFailCause : int32_t {
    E_SUCCESS = 0,
    E_RADIO_NOT_AVAILABLE = 1, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_SUCCESS implicitly + 1)
    E_GENERIC_FAILURE = 2, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_RADIO_NOT_AVAILABLE implicitly + 1)
    E_REQUEST_NOT_SUPPORTED = 3, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_GENERIC_FAILURE implicitly + 1)
    E_CANCELLED = 4, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_REQUEST_NOT_SUPPORTED implicitly + 1)
    E_UNUSED = 5, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_CANCELLED implicitly + 1)
    E_INVALID_PARAMETER = 6, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_UNUSED implicitly + 1)
    E_REJECTED_BY_REMOTE = 7, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_INVALID_PARAMETER implicitly + 1)
    E_IMS_DEREGISTERED = 8, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_REJECTED_BY_REMOTE implicitly + 1)
    E_NETWORK_NOT_SUPPORTED = 9, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_IMS_DEREGISTERED implicitly + 1)
    E_HOLD_RESUME_FAILED = 10, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_NETWORK_NOT_SUPPORTED implicitly + 1)
    E_HOLD_RESUME_CANCELED = 11, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_HOLD_RESUME_FAILED implicitly + 1)
    E_REINVITE_COLLISION = 12, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_HOLD_RESUME_CANCELED implicitly + 1)
    E_INVALID = 13, // (::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause.E_REINVITE_COLLISION implicitly + 1)
};

enum class NotificationType : int32_t {
    MO = 0,
    MT = 1, // (::vendor::qti::hardware::radio::ims::V1_0::NotificationType.MO implicitly + 1)
    INVALID = 2, // (::vendor::qti::hardware::radio::ims::V1_0::NotificationType.MT implicitly + 1)
};

enum class MessageType : int32_t {
    MWI_MSG_NONE = 0,
    MWI_MSG_VOICE = 1, // (::vendor::qti::hardware::radio::ims::V1_0::MessageType.MWI_MSG_NONE implicitly + 1)
    MWI_MSG_VIDEO = 2, // (::vendor::qti::hardware::radio::ims::V1_0::MessageType.MWI_MSG_VOICE implicitly + 1)
    MWI_MSG_FAX = 3, // (::vendor::qti::hardware::radio::ims::V1_0::MessageType.MWI_MSG_VIDEO implicitly + 1)
    MWI_MSG_PAGER = 4, // (::vendor::qti::hardware::radio::ims::V1_0::MessageType.MWI_MSG_FAX implicitly + 1)
    MWI_MSG_MULTIMEDIA = 5, // (::vendor::qti::hardware::radio::ims::V1_0::MessageType.MWI_MSG_PAGER implicitly + 1)
    MWI_MSG_TEXT = 6, // (::vendor::qti::hardware::radio::ims::V1_0::MessageType.MWI_MSG_MULTIMEDIA implicitly + 1)
    MWI_MSG_INVALID = 7, // (::vendor::qti::hardware::radio::ims::V1_0::MessageType.MWI_MSG_TEXT implicitly + 1)
};

enum class MessagePriority : int32_t {
    MWI_MSG_PRIORITY_UNKNOWN = 0,
    MWI_MSG_PRIORITY_LOW = 1, // (::vendor::qti::hardware::radio::ims::V1_0::MessagePriority.MWI_MSG_PRIORITY_UNKNOWN implicitly + 1)
    MWI_MSG_PRIORITY_NORMAL = 2, // (::vendor::qti::hardware::radio::ims::V1_0::MessagePriority.MWI_MSG_PRIORITY_LOW implicitly + 1)
    MWI_MSG_PRIORITY_URGENT = 3, // (::vendor::qti::hardware::radio::ims::V1_0::MessagePriority.MWI_MSG_PRIORITY_NORMAL implicitly + 1)
    MWI_MSG_PRIORITY_INVALID = 4, // (::vendor::qti::hardware::radio::ims::V1_0::MessagePriority.MWI_MSG_PRIORITY_URGENT implicitly + 1)
};

enum class EctType : int32_t {
    BLIND_TRANSFER = 0,
    ASSURED_TRANSFER = 1, // (::vendor::qti::hardware::radio::ims::V1_0::EctType.BLIND_TRANSFER implicitly + 1)
    CONSULTATIVE_TRANSFER = 2, // (::vendor::qti::hardware::radio::ims::V1_0::EctType.ASSURED_TRANSFER implicitly + 1)
    INVALID = 3, // (::vendor::qti::hardware::radio::ims::V1_0::EctType.CONSULTATIVE_TRANSFER implicitly + 1)
};

enum class ConfParticipantOperation : int32_t {
    ADD = 0,
    REMOVE = 1, // (::vendor::qti::hardware::radio::ims::V1_0::ConfParticipantOperation.ADD implicitly + 1)
    INVALID = 2, // (::vendor::qti::hardware::radio::ims::V1_0::ConfParticipantOperation.REMOVE implicitly + 1)
};

enum class BlockReasonType : int32_t {
    PDP_FAILURE = 0,
    REGISTRATION_FAILURE = 1, // (::vendor::qti::hardware::radio::ims::V1_0::BlockReasonType.PDP_FAILURE implicitly + 1)
    HANDOVER_FAILURE = 2, // (::vendor::qti::hardware::radio::ims::V1_0::BlockReasonType.REGISTRATION_FAILURE implicitly + 1)
    OTHER_FAILURE = 3, // (::vendor::qti::hardware::radio::ims::V1_0::BlockReasonType.HANDOVER_FAILURE implicitly + 1)
    INVALID = 4, // (::vendor::qti::hardware::radio::ims::V1_0::BlockReasonType.OTHER_FAILURE implicitly + 1)
};

enum class RegFailureReasonType : int32_t {
    UNSPECIFIED = 0,
    MOBILE_IP = 1, // (::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType.UNSPECIFIED implicitly + 1)
    INTERNAL = 2, // (::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType.MOBILE_IP implicitly + 1)
    CALL_MANAGER_DEFINED = 3, // (::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType.INTERNAL implicitly + 1)
    TYPE_3GPP_SPEC_DEFINED = 4, // (::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType.CALL_MANAGER_DEFINED implicitly + 1)
    PPP = 5, // (::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType.TYPE_3GPP_SPEC_DEFINED implicitly + 1)
    EHRPD = 6, // (::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType.PPP implicitly + 1)
    IPV6 = 7, // (::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType.EHRPD implicitly + 1)
    IWLAN = 8, // (::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType.IPV6 implicitly + 1)
    HANDOFF = 9, // (::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType.IWLAN implicitly + 1)
    INVALID = 10, // (::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType.HANDOFF implicitly + 1)
};

enum class RttMode : int32_t {
    RTT_MODE_DISABLED = 0,
    RTT_MODE_FULL = 1, // (::vendor::qti::hardware::radio::ims::V1_0::RttMode.RTT_MODE_DISABLED implicitly + 1)
    RTT_MODE_INVALID = 2, // (::vendor::qti::hardware::radio::ims::V1_0::RttMode.RTT_MODE_FULL implicitly + 1)
};

struct RegistrationInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::RegState state __attribute__ ((aligned(4)));
    uint32_t errorCode __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string errorMessage __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_0::RadioTechType radioTech __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string pAssociatedUris __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::RegistrationInfo, state) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::RegistrationInfo, errorCode) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::RegistrationInfo, errorMessage) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::RegistrationInfo, radioTech) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::RegistrationInfo, pAssociatedUris) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::RegistrationInfo) == 48, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::RegistrationInfo) == 8, "wrong alignment");

struct StatusForAccessTech final {
    ::vendor::qti::hardware::radio::ims::V1_0::RadioTechType networkMode __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::StatusType status __attribute__ ((aligned(4)));
    uint32_t restrictCause __attribute__ ((aligned(4)));
    bool hasRegistration __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::RegistrationInfo registration __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StatusForAccessTech, networkMode) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StatusForAccessTech, status) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StatusForAccessTech, restrictCause) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StatusForAccessTech, hasRegistration) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StatusForAccessTech, registration) == 16, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::StatusForAccessTech) == 64, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::StatusForAccessTech) == 8, "wrong alignment");

struct ServiceStatusInfo final {
    bool hasIsValid __attribute__ ((aligned(1)));
    bool isValid __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::ServiceType type __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallType callType __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::StatusType status __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> userdata __attribute__ ((aligned(8)));
    uint32_t restrictCause __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::StatusForAccessTech> accTechStatus __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_0::RttMode rttMode __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo, hasIsValid) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo, isValid) == 1, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo, type) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo, callType) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo, status) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo, userdata) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo, restrictCause) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo, accTechStatus) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo, rttMode) == 56, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo) == 64, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo) == 8, "wrong alignment");

struct CallDetails final {
    ::vendor::qti::hardware::radio::ims::V1_0::CallType callType __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallDomain callDomain __attribute__ ((aligned(4)));
    uint32_t extrasLength __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> extras __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo> localAbility __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::ServiceStatusInfo> peerAbility __attribute__ ((aligned(8)));
    uint32_t callSubstate __attribute__ ((aligned(4)));
    uint32_t mediaId __attribute__ ((aligned(4)));
    uint32_t causeCode __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::RttMode rttMode __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string sipAlternateUri __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, callType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, callDomain) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, extrasLength) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, extras) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, localAbility) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, peerAbility) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, callSubstate) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, mediaId) == 68, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, causeCode) == 72, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, rttMode) == 76, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails, sipAlternateUri) == 80, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails) == 96, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::CallDetails) == 8, "wrong alignment");

struct DialRequest final {
    ::android::hardware::hidl_string address __attribute__ ((aligned(8)));
    uint32_t clirMode __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::IpPresentation presentation __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallDetails callDetails __attribute__ ((aligned(8)));
    bool hasIsConferenceUri __attribute__ ((aligned(1)));
    bool isConferenceUri __attribute__ ((aligned(1)));
    bool hasIsCallPull __attribute__ ((aligned(1)));
    bool isCallPull __attribute__ ((aligned(1)));
    bool hasIsEncrypted __attribute__ ((aligned(1)));
    bool isEncrypted __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, address) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, clirMode) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, presentation) == 20, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, hasCallDetails) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, callDetails) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, hasIsConferenceUri) == 128, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, isConferenceUri) == 129, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, hasIsCallPull) == 130, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, isCallPull) == 131, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, hasIsEncrypted) == 132, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest, isEncrypted) == 133, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest) == 136, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::DialRequest) == 8, "wrong alignment");

struct SipErrorInfo final {
    uint32_t errorCode __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string errorString __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo, errorCode) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo, errorString) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo) == 8, "wrong alignment");

struct CallFailCauseResponse final {
    ::vendor::qti::hardware::radio::ims::V1_0::CallFailCause failCause __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> errorinfo __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string networkErrorString __attribute__ ((aligned(8)));
    bool hasErrorDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo errorDetails __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFailCauseResponse, failCause) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFailCauseResponse, errorinfo) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFailCauseResponse, networkErrorString) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFailCauseResponse, hasErrorDetails) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFailCauseResponse, errorDetails) == 48, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::CallFailCauseResponse) == 72, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::CallFailCauseResponse) == 8, "wrong alignment");

struct HangupRequestInfo final {
    uint32_t connIndex __attribute__ ((aligned(4)));
    bool hasMultiParty __attribute__ ((aligned(1)));
    bool multiParty __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string connUri __attribute__ ((aligned(8)));
    uint32_t conf_id __attribute__ ((aligned(4)));
    bool hasFailCauseResponse __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallFailCauseResponse failCauseResponse __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HangupRequestInfo, connIndex) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HangupRequestInfo, hasMultiParty) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HangupRequestInfo, multiParty) == 5, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HangupRequestInfo, connUri) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HangupRequestInfo, conf_id) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HangupRequestInfo, hasFailCauseResponse) == 28, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HangupRequestInfo, failCauseResponse) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::HangupRequestInfo) == 104, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::HangupRequestInfo) == 8, "wrong alignment");

struct ConfigInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::ConfigItem item __attribute__ ((aligned(4)));
    bool hasBoolValue __attribute__ ((aligned(1)));
    bool boolValue __attribute__ ((aligned(1)));
    uint32_t intValue __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string stringValue __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_0::ConfigFailureCause errorCause __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ConfigInfo, item) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ConfigInfo, hasBoolValue) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ConfigInfo, boolValue) == 5, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ConfigInfo, intValue) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ConfigInfo, stringValue) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ConfigInfo, errorCause) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::ConfigInfo) == 40, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::ConfigInfo) == 8, "wrong alignment");

struct Extra final {
    ::vendor::qti::hardware::radio::ims::V1_0::ExtraType type __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> extraInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::Extra, type) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::Extra, extraInfo) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::Extra) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::Extra) == 8, "wrong alignment");

struct HandoverInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::HandoverType type __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::RadioTechType srcTech __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::RadioTechType targetTech __attribute__ ((aligned(4)));
    bool hasHoExtra __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::Extra hoExtra __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string errorCode __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string errorMessage __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HandoverInfo, type) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HandoverInfo, srcTech) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HandoverInfo, targetTech) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HandoverInfo, hasHoExtra) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HandoverInfo, hoExtra) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HandoverInfo, errorCode) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::HandoverInfo, errorMessage) == 56, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::HandoverInfo) == 72, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::HandoverInfo) == 8, "wrong alignment");

struct CallInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::CallState state __attribute__ ((aligned(4)));
    uint32_t index __attribute__ ((aligned(4)));
    uint32_t toa __attribute__ ((aligned(4)));
    bool hasIsMpty __attribute__ ((aligned(1)));
    bool isMpty __attribute__ ((aligned(1)));
    bool hasIsMT __attribute__ ((aligned(1)));
    bool isMT __attribute__ ((aligned(1)));
    uint32_t als __attribute__ ((aligned(4)));
    bool hasIsVoice __attribute__ ((aligned(1)));
    bool isVoice __attribute__ ((aligned(1)));
    bool hasIsVoicePrivacy __attribute__ ((aligned(1)));
    bool isVoicePrivacy __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    uint32_t numberPresentation __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    uint32_t namePresentation __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallDetails callDetails __attribute__ ((aligned(8)));
    bool hasFailCause __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallFailCauseResponse failCause __attribute__ ((aligned(8)));
    bool hasIsEncrypted __attribute__ ((aligned(1)));
    bool isEncrypted __attribute__ ((aligned(1)));
    bool hasIsCalledPartyRinging __attribute__ ((aligned(1)));
    bool isCalledPartyRinging __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string historyInfo __attribute__ ((aligned(8)));
    bool hasIsVideoConfSupported __attribute__ ((aligned(1)));
    bool isVideoConfSupported __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, state) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, index) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, toa) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, hasIsMpty) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, isMpty) == 13, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, hasIsMT) == 14, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, isMT) == 15, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, als) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, hasIsVoice) == 20, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, isVoice) == 21, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, hasIsVoicePrivacy) == 22, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, isVoicePrivacy) == 23, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, number) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, numberPresentation) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, name) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, namePresentation) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, hasCallDetails) == 68, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, callDetails) == 72, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, hasFailCause) == 168, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, failCause) == 176, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, hasIsEncrypted) == 248, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, isEncrypted) == 249, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, hasIsCalledPartyRinging) == 250, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, isCalledPartyRinging) == 251, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, historyInfo) == 256, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, hasIsVideoConfSupported) == 272, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo, isVideoConfSupported) == 273, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo) == 280, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::CallInfo) == 8, "wrong alignment");

struct CbNumInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::ServiceClassStatus status __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CbNumInfo, status) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CbNumInfo, number) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::CbNumInfo) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::CbNumInfo) == 8, "wrong alignment");

struct CbNumListInfo final {
    uint32_t serviceClass __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::CbNumInfo> cbNumInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CbNumListInfo, serviceClass) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CbNumListInfo, cbNumInfo) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::CbNumListInfo) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::CbNumListInfo) == 8, "wrong alignment");

struct SuppServiceStatus final {
    ::vendor::qti::hardware::radio::ims::V1_0::ServiceClassStatus status __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::FacilityType facilityType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string failureCause __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::CbNumListInfo> cbNumListInfo __attribute__ ((aligned(8)));
    bool hasErrorDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo errorDetails __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceStatus, status) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceStatus, facilityType) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceStatus, failureCause) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceStatus, cbNumListInfo) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceStatus, hasErrorDetails) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceStatus, errorDetails) == 48, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceStatus) == 72, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceStatus) == 8, "wrong alignment");

struct ClipProvisionStatus final {
    ::vendor::qti::hardware::radio::ims::V1_0::ClipStatus clipStatus __attribute__ ((aligned(4)));
    bool hasErrorDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo errorDetails __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ClipProvisionStatus, clipStatus) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ClipProvisionStatus, hasErrorDetails) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ClipProvisionStatus, errorDetails) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::ClipProvisionStatus) == 32, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::ClipProvisionStatus) == 8, "wrong alignment");

struct ClirInfo final {
    uint32_t paramM __attribute__ ((aligned(4)));
    uint32_t paramN __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ClirInfo, paramM) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ClirInfo, paramN) == 4, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::ClirInfo) == 8, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::ClirInfo) == 4, "wrong alignment");

struct ColrInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::IpPresentation presentation __attribute__ ((aligned(4)));
    bool hasErrorDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::SipErrorInfo errorDetails __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ColrInfo, presentation) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ColrInfo, hasErrorDetails) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ColrInfo, errorDetails) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::ColrInfo) == 32, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::ColrInfo) == 8, "wrong alignment");

struct DtmfInfo final {
    ::android::hardware::hidl_string dtmf __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DtmfInfo, dtmf) == 0, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::DtmfInfo) == 16, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::DtmfInfo) == 8, "wrong alignment");

struct TtyInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::TtyMode mode __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<uint8_t> userData __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::TtyInfo, mode) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::TtyInfo, userData) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::TtyInfo) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::TtyInfo) == 8, "wrong alignment");

struct ConferenceInfo final {
    ::android::hardware::hidl_vec<uint8_t> confInfoUri __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_0::ConferenceCallState conferenceCallState __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ConferenceInfo, confInfoUri) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ConferenceInfo, conferenceCallState) == 16, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::ConferenceInfo) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::ConferenceInfo) == 8, "wrong alignment");

struct ViceInfo final {
    ::android::hardware::hidl_vec<uint8_t> viceInfoUri __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ViceInfo, viceInfoUri) == 0, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::ViceInfo) == 16, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::ViceInfo) == 8, "wrong alignment");

struct CallModifyInfo final {
    uint32_t callIndex __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallDetails callDetails __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallModifyFailCause failCause __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallModifyInfo, callIndex) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallModifyInfo, hasCallDetails) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallModifyInfo, callDetails) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallModifyInfo, failCause) == 104, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::CallModifyInfo) == 112, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::CallModifyInfo) == 8, "wrong alignment");

struct CallFwdTimerInfo final {
    uint32_t year __attribute__ ((aligned(4)));
    uint32_t month __attribute__ ((aligned(4)));
    uint32_t day __attribute__ ((aligned(4)));
    uint32_t hour __attribute__ ((aligned(4)));
    uint32_t minute __attribute__ ((aligned(4)));
    uint32_t second __attribute__ ((aligned(4)));
    uint32_t timezone __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo, year) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo, month) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo, day) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo, hour) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo, minute) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo, second) == 20, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo, timezone) == 24, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo) == 28, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo) == 4, "wrong alignment");

struct CallForwardInfo final {
    uint32_t status __attribute__ ((aligned(4)));
    uint32_t reason __attribute__ ((aligned(4)));
    uint32_t serviceClass __attribute__ ((aligned(4)));
    uint32_t toa __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    uint32_t timeSeconds __attribute__ ((aligned(4)));
    bool hasCallFwdTimerStart __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo callFwdTimerStart __attribute__ ((aligned(4)));
    bool hasCallFwdTimerEnd __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallFwdTimerInfo callFwdTimerEnd __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo, status) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo, reason) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo, serviceClass) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo, toa) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo, number) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo, timeSeconds) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo, hasCallFwdTimerStart) == 36, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo, callFwdTimerStart) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo, hasCallFwdTimerEnd) == 68, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo, callFwdTimerEnd) == 72, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo) == 104, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo) == 8, "wrong alignment");

struct SuppServiceNotification final {
    ::vendor::qti::hardware::radio::ims::V1_0::NotificationType notificationType __attribute__ ((aligned(4)));
    uint32_t code __attribute__ ((aligned(4)));
    uint32_t index __attribute__ ((aligned(4)));
    uint32_t type __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    uint32_t connId __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string historyInfo __attribute__ ((aligned(8)));
    bool hasHoldTone __attribute__ ((aligned(1)));
    bool holdTone __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification, notificationType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification, code) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification, index) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification, type) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification, number) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification, connId) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification, historyInfo) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification, hasHoldTone) == 56, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification, holdTone) == 57, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification) == 64, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::SuppServiceNotification) == 8, "wrong alignment");

struct ExplicitCallTransferInfo final {
    uint32_t callId __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::EctType ectType __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string targetAddress __attribute__ ((aligned(8)));
    uint32_t targetCallId __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ExplicitCallTransferInfo, callId) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ExplicitCallTransferInfo, ectType) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ExplicitCallTransferInfo, targetAddress) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ExplicitCallTransferInfo, targetCallId) == 24, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::ExplicitCallTransferInfo) == 32, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::ExplicitCallTransferInfo) == 8, "wrong alignment");

struct MessageSummary final {
    ::vendor::qti::hardware::radio::ims::V1_0::MessageType type __attribute__ ((aligned(4)));
    uint32_t newMessageCount __attribute__ ((aligned(4)));
    uint32_t oldMessageCount __attribute__ ((aligned(4)));
    uint32_t newUrgentMessageCount __attribute__ ((aligned(4)));
    uint32_t oldUrgentMessageCount __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageSummary, type) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageSummary, newMessageCount) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageSummary, oldMessageCount) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageSummary, newUrgentMessageCount) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageSummary, oldUrgentMessageCount) == 16, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::MessageSummary) == 20, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::MessageSummary) == 4, "wrong alignment");

struct MessageDetails final {
    ::android::hardware::hidl_string toAddress __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string fromAddress __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string subject __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string date __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_0::MessagePriority priority __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string id __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_0::MessageType type __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageDetails, toAddress) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageDetails, fromAddress) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageDetails, subject) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageDetails, date) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageDetails, priority) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageDetails, id) == 72, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageDetails, type) == 88, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::MessageDetails) == 96, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::MessageDetails) == 8, "wrong alignment");

struct MessageWaitingIndication final {
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::MessageSummary> messageSummary __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string ueAddress __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::MessageDetails> messageDetails __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageWaitingIndication, messageSummary) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageWaitingIndication, ueAddress) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::MessageWaitingIndication, messageDetails) == 32, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::MessageWaitingIndication) == 48, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::MessageWaitingIndication) == 8, "wrong alignment");

struct DeflectRequestInfo final {
    uint32_t connIndex __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DeflectRequestInfo, connIndex) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::DeflectRequestInfo, number) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::DeflectRequestInfo) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::DeflectRequestInfo) == 8, "wrong alignment");

struct AddressInfo final {
    ::android::hardware::hidl_string city __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string state __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string country __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string postalCode __attribute__ ((aligned(8)));
    ::android::hardware::hidl_string countryCode __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::AddressInfo, city) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::AddressInfo, state) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::AddressInfo, country) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::AddressInfo, postalCode) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::AddressInfo, countryCode) == 64, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::AddressInfo) == 80, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::AddressInfo) == 8, "wrong alignment");

struct ImsSubConfigInfo final {
    uint32_t simultStackCount __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<bool> imsStackEnabled __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ImsSubConfigInfo, simultStackCount) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ImsSubConfigInfo, imsStackEnabled) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::ImsSubConfigInfo) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::ImsSubConfigInfo) == 8, "wrong alignment");

struct ParticipantStatusInfo final {
    uint32_t callId __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::ConfParticipantOperation operation __attribute__ ((aligned(4)));
    uint32_t sipStatus __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string participantUri __attribute__ ((aligned(8)));
    bool hasIsEct __attribute__ ((aligned(1)));
    bool isEct __attribute__ ((aligned(1)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ParticipantStatusInfo, callId) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ParticipantStatusInfo, operation) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ParticipantStatusInfo, sipStatus) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ParticipantStatusInfo, participantUri) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ParticipantStatusInfo, hasIsEct) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::ParticipantStatusInfo, isEct) == 33, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::ParticipantStatusInfo) == 40, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::ParticipantStatusInfo) == 8, "wrong alignment");

struct BlockReasonDetails final {
    ::vendor::qti::hardware::radio::ims::V1_0::RegFailureReasonType regFailureReasonType __attribute__ ((aligned(4)));
    uint32_t regFailureReason __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::BlockReasonDetails, regFailureReasonType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::BlockReasonDetails, regFailureReason) == 4, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::BlockReasonDetails) == 8, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::BlockReasonDetails) == 4, "wrong alignment");

struct BlockStatus final {
    ::vendor::qti::hardware::radio::ims::V1_0::BlockReasonType blockReason __attribute__ ((aligned(4)));
    bool hasBlockReasonDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::BlockReasonDetails blockReasonDetails __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::BlockStatus, blockReason) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::BlockStatus, hasBlockReasonDetails) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::BlockStatus, blockReasonDetails) == 8, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::BlockStatus) == 16, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::BlockStatus) == 4, "wrong alignment");

enum class VoWiFiCallQualityInfo : int32_t {
    VOWIFI_CALL_QUALITY_NONE = 0,
    VOWIFI_CALL_QUALITY_EXCELLENT = 1, // (::vendor::qti::hardware::radio::ims::V1_0::VoWiFiCallQualityInfo.VOWIFI_CALL_QUALITY_NONE implicitly + 1)
    VOWIFI_CALL_QUALITY_FAIR = 2, // (::vendor::qti::hardware::radio::ims::V1_0::VoWiFiCallQualityInfo.VOWIFI_CALL_QUALITY_EXCELLENT implicitly + 1)
    VOWIFI_CALL_QUALITY_BAD = 3, // (::vendor::qti::hardware::radio::ims::V1_0::VoWiFiCallQualityInfo.VOWIFI_CALL_QUALITY_FAIR implicitly + 1)
    VOWIFI_CALL_QUALITY_INVALID = 4, // (::vendor::qti::hardware::radio::ims::V1_0::VoWiFiCallQualityInfo.VOWIFI_CALL_QUALITY_BAD implicitly + 1)
};

enum class SsServiceType : int32_t {
    SS_CFU = 0,
    SS_CF_BUSY = 1, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_CFU implicitly + 1)
    SS_CF_NO_REPLY = 2, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_CF_BUSY implicitly + 1)
    SS_CF_NOT_REACHABLE = 3, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_CF_NO_REPLY implicitly + 1)
    SS_CF_ALL = 4, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_CF_NOT_REACHABLE implicitly + 1)
    SS_CF_ALL_CONDITIONAL = 5, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_CF_ALL implicitly + 1)
    SS_CFUT = 6, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_CF_ALL_CONDITIONAL implicitly + 1)
    SS_CLIP = 7, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_CFUT implicitly + 1)
    SS_CLIR = 8, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_CLIP implicitly + 1)
    SS_COLP = 9, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_CLIR implicitly + 1)
    SS_COLR = 10, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_COLP implicitly + 1)
    SS_CNAP = 11, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_COLR implicitly + 1)
    SS_WAIT = 12, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_CNAP implicitly + 1)
    SS_BAOC = 13, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_WAIT implicitly + 1)
    SS_BAOIC = 14, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_BAOC implicitly + 1)
    SS_BAOIC_EXC_HOME = 15, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_BAOIC implicitly + 1)
    SS_BAIC = 16, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_BAOIC_EXC_HOME implicitly + 1)
    SS_BAIC_ROAMING = 17, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_BAIC implicitly + 1)
    SS_ALL_BARRING = 18, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_BAIC_ROAMING implicitly + 1)
    SS_OUTGOING_BARRING = 19, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_ALL_BARRING implicitly + 1)
    SS_INCOMING_BARRING = 20, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_OUTGOING_BARRING implicitly + 1)
    SS_INCOMING_BARRING_DN = 21, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_INCOMING_BARRING implicitly + 1)
    SS_INCOMING_BARRING_ANONYMOUS = 22, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_INCOMING_BARRING_DN implicitly + 1)
    SS_INVALID = 23, // (::vendor::qti::hardware::radio::ims::V1_0::SsServiceType.SS_INCOMING_BARRING_ANONYMOUS implicitly + 1)
};

enum class SsRequestType : int32_t {
    SS_ACTIVATION = 0,
    SS_DEACTIVATION = 1, // (::vendor::qti::hardware::radio::ims::V1_0::SsRequestType.SS_ACTIVATION implicitly + 1)
    SS_INTERROGATION = 2, // (::vendor::qti::hardware::radio::ims::V1_0::SsRequestType.SS_DEACTIVATION implicitly + 1)
    SS_REGISTRATION = 3, // (::vendor::qti::hardware::radio::ims::V1_0::SsRequestType.SS_INTERROGATION implicitly + 1)
    SS_ERASURE = 4, // (::vendor::qti::hardware::radio::ims::V1_0::SsRequestType.SS_REGISTRATION implicitly + 1)
    SS_INVALID = 5, // (::vendor::qti::hardware::radio::ims::V1_0::SsRequestType.SS_ERASURE implicitly + 1)
};

enum class SsTeleserviceType : int32_t {
    SS_ALL_TELE_AND_BEARER_SERVICES = 0,
    SS_ALL_TELESEVICES = 1, // (::vendor::qti::hardware::radio::ims::V1_0::SsTeleserviceType.SS_ALL_TELE_AND_BEARER_SERVICES implicitly + 1)
    SS_TELEPHONY = 2, // (::vendor::qti::hardware::radio::ims::V1_0::SsTeleserviceType.SS_ALL_TELESEVICES implicitly + 1)
    SS_ALL_DATA_TELESERVICES = 3, // (::vendor::qti::hardware::radio::ims::V1_0::SsTeleserviceType.SS_TELEPHONY implicitly + 1)
    SS_SMS_SERVICES = 4, // (::vendor::qti::hardware::radio::ims::V1_0::SsTeleserviceType.SS_ALL_DATA_TELESERVICES implicitly + 1)
    SS_ALL_TELESERVICES_EXCEPT_SMS = 5, // (::vendor::qti::hardware::radio::ims::V1_0::SsTeleserviceType.SS_SMS_SERVICES implicitly + 1)
    SS_INVALID = 6, // (::vendor::qti::hardware::radio::ims::V1_0::SsTeleserviceType.SS_ALL_TELESERVICES_EXCEPT_SMS implicitly + 1)
};

struct CfData final {
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::CallForwardInfo> cfInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::CfData, cfInfo) == 0, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::CfData) == 16, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::CfData) == 8, "wrong alignment");

struct SsInfoData final {
    ::android::hardware::hidl_vec<uint32_t> ssInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::SsInfoData, ssInfo) == 0, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::SsInfoData) == 16, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::SsInfoData) == 8, "wrong alignment");

struct StkCcUnsolSsResult final {
    ::vendor::qti::hardware::radio::ims::V1_0::SsServiceType serviceType __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::SsRequestType requestType __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::SsTeleserviceType teleserviceType __attribute__ ((aligned(4)));
    uint32_t serviceClass __attribute__ ((aligned(4)));
    uint32_t result __attribute__ ((aligned(4)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::SsInfoData> ssInfoData __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::CfData> cfData __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::vendor::qti::hardware::radio::ims::V1_0::CbNumInfo> cbNumInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StkCcUnsolSsResult, serviceType) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StkCcUnsolSsResult, requestType) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StkCcUnsolSsResult, teleserviceType) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StkCcUnsolSsResult, serviceClass) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StkCcUnsolSsResult, result) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StkCcUnsolSsResult, ssInfoData) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StkCcUnsolSsResult, cfData) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_0::StkCcUnsolSsResult, cbNumInfo) == 56, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_0::StkCcUnsolSsResult) == 72, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_0::StkCcUnsolSsResult) == 8, "wrong alignment");

constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_0::IpPresentation lhs, const ::vendor::qti::hardware::radio::ims::V1_0::IpPresentation rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}

constexpr int32_t operator|(const int32_t lhs, const ::vendor::qti::hardware::radio::ims::V1_0::IpPresentation rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}

constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_0::IpPresentation lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}

constexpr int32_t operator&(const ::vendor::qti::hardware::radio::ims::V1_0::IpPresentation lhs, const ::vendor::qti::hardware::radio::ims::V1_0::IpPresentation rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) & static_cast<int32_t>(rhs));
}

