/*
  Copyright (c) 2018 Qualcomm Technologies, Inc.
  All Rights Reserved.
  Confidential and Proprietary - Qualcomm Technologies, Inc.
*/

#ifndef HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_4_TYPES_H
#define HIDL_GENERATED_VENDOR_QTI_HARDWARE_RADIO_IMS_V1_4_TYPES_H

#include <vendor/qti/hardware/radio/ims/1.0/types.h>
#include <vendor/qti/hardware/radio/ims/1.3/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace vendor {
namespace qti {
namespace hardware {
namespace radio {
namespace ims {
namespace V1_4 {

// Forward declaration for forward reference support:
enum class MultiIdentityRegistrationStatus : int32_t;
enum class MultiIdentityLineType : int32_t;
struct MultiIdentityLineInfoHal;
struct DialRequest;
struct CallInfo;

enum class MultiIdentityRegistrationStatus : int32_t {
    STATUS_UNKNOWN = 0,
    STATUS_DISABLE = 1, // (::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityRegistrationStatus.STATUS_UNKNOWN implicitly + 1)
    STATUS_ENABLE = 2, // (::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityRegistrationStatus.STATUS_DISABLE implicitly + 1)
};

enum class MultiIdentityLineType : int32_t {
    LINE_TYPE_UNKNOWN = 0,
    LINE_TYPE_PRIMARY = 1, // (::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineType.LINE_TYPE_UNKNOWN implicitly + 1)
    LINE_TYPE_SECONDARY = 2, // (::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineType.LINE_TYPE_PRIMARY implicitly + 1)
};

struct MultiIdentityLineInfoHal final {
    ::android::hardware::hidl_string msisdn __attribute__ ((aligned(8)));
    ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityRegistrationStatus registrationStatus __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineType lineType __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal, msisdn) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal, registrationStatus) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal, lineType) == 20, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal) == 24, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal) == 8, "wrong alignment");

struct DialRequest final {
    ::android::hardware::hidl_string address __attribute__ ((aligned(8)));
    uint32_t clirMode __attribute__ ((aligned(4)));
    ::vendor::qti::hardware::radio::ims::V1_0::IpPresentation presentation __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallDetails callDetails __attribute__ ((aligned(8)));
    bool hasIsConferenceUri __attribute__ ((aligned(1)));
    bool isConferenceUri __attribute__ ((aligned(1)));
    bool hasIsCallPull __attribute__ ((aligned(1)));
    bool isCallPull __attribute__ ((aligned(1)));
    bool hasIsEncrypted __attribute__ ((aligned(1)));
    bool isEncrypted __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal multiLineInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, address) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, clirMode) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, presentation) == 20, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, hasCallDetails) == 24, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, callDetails) == 32, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, hasIsConferenceUri) == 128, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, isConferenceUri) == 129, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, hasIsCallPull) == 130, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, isCallPull) == 131, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, hasIsEncrypted) == 132, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, isEncrypted) == 133, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest, multiLineInfo) == 136, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest) == 160, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_4::DialRequest) == 8, "wrong alignment");

struct CallInfo final {
    ::vendor::qti::hardware::radio::ims::V1_0::CallState state __attribute__ ((aligned(4)));
    uint32_t index __attribute__ ((aligned(4)));
    uint32_t toa __attribute__ ((aligned(4)));
    bool hasIsMpty __attribute__ ((aligned(1)));
    bool isMpty __attribute__ ((aligned(1)));
    bool hasIsMT __attribute__ ((aligned(1)));
    bool isMT __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityLineInfoHal mtMultiLineInfo __attribute__ ((aligned(8)));
    uint32_t als __attribute__ ((aligned(4)));
    bool hasIsVoice __attribute__ ((aligned(1)));
    bool isVoice __attribute__ ((aligned(1)));
    bool hasIsVoicePrivacy __attribute__ ((aligned(1)));
    bool isVoicePrivacy __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    uint32_t numberPresentation __attribute__ ((aligned(4)));
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    uint32_t namePresentation __attribute__ ((aligned(4)));
    bool hasCallDetails __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_0::CallDetails callDetails __attribute__ ((aligned(8)));
    bool hasFailCause __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_3::CallFailCauseResponse failCause __attribute__ ((aligned(8)));
    bool hasIsEncrypted __attribute__ ((aligned(1)));
    bool isEncrypted __attribute__ ((aligned(1)));
    bool hasIsCalledPartyRinging __attribute__ ((aligned(1)));
    bool isCalledPartyRinging __attribute__ ((aligned(1)));
    ::android::hardware::hidl_string historyInfo __attribute__ ((aligned(8)));
    bool hasIsVideoConfSupported __attribute__ ((aligned(1)));
    bool isVideoConfSupported __attribute__ ((aligned(1)));
    ::vendor::qti::hardware::radio::ims::V1_3::VerstatInfo verstatInfo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, state) == 0, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, index) == 4, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, toa) == 8, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, hasIsMpty) == 12, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, isMpty) == 13, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, hasIsMT) == 14, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, isMT) == 15, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, mtMultiLineInfo) == 16, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, als) == 40, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, hasIsVoice) == 44, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, isVoice) == 45, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, hasIsVoicePrivacy) == 46, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, isVoicePrivacy) == 47, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, number) == 48, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, numberPresentation) == 64, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, name) == 72, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, namePresentation) == 88, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, hasCallDetails) == 92, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, callDetails) == 96, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, hasFailCause) == 192, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, failCause) == 200, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, hasIsEncrypted) == 272, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, isEncrypted) == 273, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, hasIsCalledPartyRinging) == 274, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, isCalledPartyRinging) == 275, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, historyInfo) == 280, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, hasIsVideoConfSupported) == 296, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, isVideoConfSupported) == 297, "wrong offset");
static_assert(offsetof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo, verstatInfo) == 300, "wrong offset");
static_assert(sizeof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo) == 312, "wrong size");
static_assert(__alignof(::vendor::qti::hardware::radio::ims::V1_4::CallInfo) == 8, "wrong alignment");

constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityRegistrationStatus lhs, const ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityRegistrationStatus rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | static_cast<int32_t>(rhs));
}

constexpr int32_t operator|(const int32_t lhs, const ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityRegistrationStatus rhs) {
    return static_cast<int32_t>(lhs | static_cast<int32_t>(rhs));
}

constexpr int32_t operator|(const ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityRegistrationStatus lhs, const int32_t rhs) {
    return static_cast<int32_t>(static_cast<int32_t>(lhs) | rhs);
}

constexpr int32_t operator&(const ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityRegistrationStatus lhs, const ::vendor::qti::hardware::radio::ims::V1_4::MultiIdentityRegistrationStatus rhs) {
